local 城镇跳过特征 = {
	城镇跳过1 = {1054 , 0 , 1279 , 120 , "ffffff-202020" , "2|2|ffffff-202020|5|-3|ffffff-202020|0|-4|ffffff-202020|1|-5|ffffff-202020|5|-2|e6ebe6-202020|7|6|ffffff-202020|5|8|ffffff-202020|5|9|ffffff-202020|2|6|ffffff-202020|-2|9|ffffff-202020|6|-10|fffbff-202020|21|-11|ffffff-202020|12|-7|ffffff-202020|16|5|ffffff-202020|11|7|ffffff-202020|25|8|ffffff-202020|-12|-4|ffffff-202020|2|-7|ffffff-202020|1|-5|ffffff-202020|-1|-4|efefef-202020|0|-3|f7f3f7-202020|-2|-1|ffffff-202020|1|1|ffffff-202020|2|2|ffffff-202020|2|5|ffffff-202020|-3|8|e6e7e6-202020|-12|9|292019-202020|-6|-11|ffffff-202020" , 0 , 0.9} ,
	城镇跳过2 = {1054 , 0 , 1279 , 120 , "f7f7f7-202020" , "5|0|ffffff-202020|2|4|ffffff-202020|5|1|adb2b5-202020|11|-4|dedfde-202020|23|-3|ffffff-202020|20|-7|ffffff-202020|15|7|ffffff-202020|19|7|ffffff-202020|23|11|ffffff-202020|-5|-7|ffffff-202020|-2|-7|ffffff-202020|-2|10|ffffff-202020|2|7|ffffff-202020|-15|-6|ffffff-202020|-11|-1|ffffff-202020|-9|-4|ffffff-202020|-9|5|ffffff-202020|-7|7|ffffff-202020|-10|9|ffffff-202020|-10|9|ffffff-202020|-16|10|ffffff-202020|-15|2|ffffff-202020" , 0 , 0.9} ,
	城镇跳过3 = {1166 , 33 , 1247 , 110 , "ffffff-202020" , "5|3|ffffff-202020|8|12|ffffff-202020|7|10|ffffff-202020|-3|12|b5b2b5-202020|-1|12|ffffff-202020|0|6|ffffff-202020|0|2|f7fbf7-202020|0|1|ffffff-202020|-13|2|ffffff-202020|-12|10|ffffff-202020|-15|5|fffbff-202020|-8|0|ffffff-202020|-10|-2|ffffff-202020|-6|8|ffffff-202020|-9|7|ffffff-202020|9|0|fffbff-202020|-10|-11|cec2ad-202020|-9|-12|d6cabd-202020|1|-30|c5bead-202020|0|-26|b5aa94-202020|-3|-26|c5baad-202020|14|-22|c5ba9c-202020|8|-26|b5a694-202020|27|-39|b5b68c-202020" , 0 , 0.9} ,
	选择地下城对话 = {1207 , 648 , 1260 , 695 , "bda263-202020" , "-5|1|ffefb5-202020|-6|2|ffefb5-202020|-6|4|bda673-202020|-4|5|bda273-202020|-2|3|bda263-202020|-3|2|f7ebb5-202020|-3|1|bda263-202020|-4|-5|ffefbd-202020|-1|-2|ffefbd-202020|-1|-1|bda263-202020|3|2|fff7bd-202020|3|3|fff3bd-202020|2|4|f7efb5-202020|0|6|fff3b5-202020|-1|6|bda273-202020|-3|9|ffefb5-202020|-4|10|f7efb5-202020|-4|19|bda673-202020|10|1|fff3bd-202020|6|-3|ffefbd-202020|5|-5|c5aa6b-202020|3|-7|bda673-202020|2|-7|ffefbd-202020|-3|-13|b5a273-202020|-9|-2|191019-202020|11|-5|190c10-202020|10|-7|190c19-202020|13|-4|191019-202020|15|-3|100810-202020|13|-3|100c10-202020|5|12|4a3119-202020|4|13|423119-202020" , 0 , 0.9} ,
	城镇跳过4 = {1173 , 38 , 1245 , 105 , "ada28c-202020" , "17|22|ffffff-202020|-5|16|c5cac5-202020|-2|22|ffffff-202020|-1|22|ffffff-202020|1|12|ffffff-202020|-3|13|ffffff-202020|-4|13|ffffff-202020|24|11|ffffff-202020|22|21|ffffff-202020|26|-17|e6dfc5-202020|25|-16|ada28c-202020|18|-38|ada28c-202020|36|-26|adaa84-202020|25|-37|c5c69c-202020" , 0 , 0.9} ,
	城镇跳过5 = {1172 , 35 , 1238 , 102 , "d6cab5-202020" , "-1|4|948e73-202020|-5|6|a49a84-202020|-10|11|d6cab5-202020|1|11|ded2b5-202020|17|11|cec2a4-202020|11|-6|7b6d52-202020|-6|21|ffffff-202020|-12|34|ffffff-202020|20|35|ffffff-202020|16|25|636163-202020|13|25|6b5d4a-202020|9|28|635942-202020|4|26|ffffff-202020|1|26|635942-202020" , 0 , 0.9} ,
}

--local 完成过去任务 = {1007 , 33 , 1082 , 53 , "fff3b5-202020" , "-1|1|fff3b5-202020|-8|2|f7efb5-202020|-8|4|fff3b5-202020|-8|5|ada684-202020|-5|4|080c10-202020|-6|6|fff3b5-202020|1|6|fff7bd-202020|5|6|fff7bd-202020|6|4|fff3b5-202020|6|5|fff3bd-202020|-8|10|fff3b5-202020|-3|10|fff7bd-202020|7|10|fff7bd-202020|-8|16|fff3b5-202020|2|16|fff3b5-202020|7|13|fff3b5-202020|7|12|9c9273-202020|6|16|fff3b5-202020|19|0|fff7bd-202020|22|1|fff3bd-202020|25|3|fff3b5-202020|11|3|e6dba4-202020|11|5|fff3b5-202020|11|13|fff3b5-202020|10|15|fff3b5-202020|10|16|fff3b5-202020|17|16|fff7bd-202020|25|12|fff7bd-202020|29|1|fff3b5-202020|33|3|fff3b5-202020|30|6|fff3b5-202020|28|16|fff3b5-202020|41|15|fff3b5-202020|40|0|fff3b5-202020|43|3|fff3b5-202020|37|12|fff7bd-202020|53|0|fff7bd-202020|47|2|211c19-202020|60|3|fff7bd-202020|46|8|fff3b5-202020|61|8|fff7bd-202020|47|15|fff3b5-202020|60|16|fff3b5-202020|56|11|fff7bd-202020|51|11|fff3b5-202020" , 0 , 0.9}

local 完成过去任务2 = {1008 , 28 , 1140 , 58 , "e6ca42-202020" , "-25|-2|e6ca42-202020|38|6|efca42-202020|51|1|e6ca42-202020|58|2|efca42-202020|56|-1|e6ca42-202020|9|-5|e6ca42-202020|13|0|d6ba3a-202020|-2|-8|efce42-202020|-9|0|e6ca42-202020|0|-5|e6ca42-202020|-16|-5|e6ca42-202020|-43|3|e6ca42-202020|-54|-6|efca42-202020|-50|-5|e6ca42-202020" , 0 , 0.9}
local 新手指引 = {628 , 23 , 1279 , 704 , "efe3c5-202020" , "1|2|fff3de-202020|2|4|fffbe6-202020|1|6|e6ca8c-202020|2|7|efd79c-202020|5|5|fffbe6-202020|7|3|deba6b-202020|7|3|deba6b-202020|10|9|fff3d6-202020|12|13|fff7de-202020|8|17|f7dfad-202020|7|18|deaa42-202020|8|29|d69a10-202020|1|27|f7dba4-202020|1|41|fffbde-202020|12|41|f7d27b-202020|23|32|fff3ce-202020|23|20|efd28c-202020|36|22|efd7a4-202020|41|25|e6ba6b-202020|45|26|efce8c-202020|29|60|e6b64a-202020|22|64|ffefbd-202020|52|53|dea621-202020|64|59|a47d08-202020|66|68|ce9a21-202020|65|79|f7ebbd-202020|54|74|f7ebbd-202020|31|81|f7e7b5-202020|28|88|efdfad-202020|50|92|efdba4-202020|58|98|e6d29c-202020|45|97|e6d79c-202020|45|81|f7ebb5-202020|19|94|efdfb5-202020|14|107|dece94-202020|19|116|d6c69c-202020" , 0 , 0.9}
local 新手指引2 = {1078 , 64 , 1240 , 229 , "fffbe6-202020" , "0|4|efdbb5-202020|0|7|a47510-202020|11|3|845908-202020|11|7|f7dfa4-202020|8|10|fffbde-202020|6|5|fff7de-202020|1|1|fff3de-202020|8|11|fff7de-202020|11|17|fff3d6-202020|14|29|fff3ce-202020|13|34|fff3d6-202020|10|43|ffefc5-202020|6|36|fff7d6-202020|2|25|f7ebce-202020|2|24|debe8c-202020|5|23|946908-202020|21|53|fff3c5-202020|22|58|f7df9c-202020|20|64|efd794-202020|19|69|ffe7b5-202020|17|74|f7dfad-202020|14|78|efd28c-202020|15|100|dec68c-202020|18|108|ceb684-202020|45|21|ad8121-202020|28|17|efca7b-202020|23|14|cea652-202020|30|30|fff3ce-202020|39|39|fff3ce-202020|43|47|f7df9c-202020|35|50|efc663-202020|30|53|efba52-202020|25|55|f7d78c-202020|23|58|e6be5a-202020|38|75|e6b652-202020|35|78|e6b64a-202020|36|84|efdfad-202020|45|89|e6d29c-202020|58|85|efdba4-202020|59|92|dece9c-202020|40|57|ffefbd-202020" , 0 , 0.9}
local 新手指引3 = {291 , 114 , 399 , 240 , "fff7de-202020" , "-1|-1|f7d7bd-202020|3|2|fff7de-202020|5|2|fff3de-202020|9|9|fffbde-202020|3|22|f7dba4-202020|35|47|ffc66b-202020|30|50|ffc25a-202020|36|60|ffebbd-202020|24|69|ffe7b5-202020|35|73|ffd28c-202020|51|67|ffbe63-202020|55|81|ffdbad-202020" , 0 , 0.9}
local 新手指引4 = {748 , 9 , 1279 , 719 , "fff7de-202020" , "-1|1|fff7de-202020|0|4|fff7de-202020|4|5|fffbde-202020|8|7|ffefce-202020|9|13|fff7de-202020|6|14|fff7de-202020|7|19|fff3d6-202020|12|31|fff3d6-202020|6|43|fff3ce-202020|35|62|ffefc5-202020|27|62|ffefc5-202020|23|75|ffefbd-202020|24|60|e6aa29-202020|30|56|e6ae3a-202020|43|52|f7c652-202020|49|52|ffc642-202020|54|76|e6b24a-202020|44|76|e6be5a-202020|33|82|e6ba5a-202020|32|84|dea221-202020|39|92|e6d7a4-202020|51|91|e6d79c-202020" , 0 , 0.9}
local 新手指引5 = {1204 , 5 , 1279 , 120 , "ffefde-202020" , "-1|-1|e6dfc5-202020|1|3|fff7de-202020|2|6|fff7de-202020|6|11|fffbde-202020|9|14|fffbde-202020|14|19|fff7de-202020|17|20|efb63a-202020|18|22|f7df9c-202020|8|29|de9a21-202020|9|37|de9a08-202020|4|36|fff7d6-202020|2|30|ffefd6-202020|1|28|f7e3b5-202020|3|39|fff3ce-202020|12|52|ffefc5-202020|21|63|fff3c5-202020|14|85|ffe7bd-202020|14|96|e6ca84-202020|17|115|e6cead-202020" , 0 , 0.9}

local 技能配置 = {516 , 43 , 627 , 73 , "efe3ad-202020" , "-10|3|c5b68c-202020|-9|6|fff3bd-202020|50|7|ada27b-202020|56|5|fff3bd-202020|54|-1|dece9c-202020|41|-5|c5ba8c-202020|46|-16|fff3b5-202020|48|-12|ffefb5-202020|38|-15|fff3bd-202020|42|-12|fff3b5-202020|23|-14|b5aa84-202020|28|7|ada27b-202020|31|0|fff3bd-202020|9|7|ffefb5-202020|20|-15|fff3bd-202020|19|2|fff3bd-202020|-33|3|bdb284-202020|-22|-13|fff3bd-202020|-43|-13|ffefb5-202020|-44|-12|ffefb5-202020|-44|-4|ffefb5-202020|-44|-3|fff3bd-202020|-42|-7|fff3bd-202020|-40|-12|ffefb5-202020" , 0 , 0.9}
local 正在移动 = {250 , 157 , 296 , 223 , "9cb284-202020" , "-5|8|ce9e84-202020|-4|-10|adbe9c-202020|5|-8|a4a68c-202020|1|-9|fffbd6-202020|7|-5|5a96e6-202020|7|-3|3165d6-202020|5|-5|5a92d6-202020|6|-1|3a0000-202020|6|1|8c2419-202020|7|3|ffffce-202020|8|3|ffffce-202020|9|3|ffffce-202020|-3|9|ffffb5-202020|-2|7|52618c-202020|0|7|214994-202020|0|11|4a4963-202020|0|18|316dc5-202020|-2|18|3169bd-202020|3|12|cebabd-202020|1|13|efe7e6-202020|-6|11|ffd2bd-202020|-10|16|52558c-202020|-11|18|5a598c-202020|-13|19|52558c-202020|-14|21|525984-202020|-14|17|e6fbff-202020|-15|19|e6ffff-202020|8|-9|f7ffde-202020|0|-6|ce8619-202020|0|-4|e69600-202020|-5|-5|a4d2a4-202020" , 0 , 0.9}
local 报告 = {818 , 219 , 946 , 276 , "e6c68c-202020" , "22|10|efdfb5-202020|23|2|fff7de-202020|14|2|fff7de-202020|21|4|e6ca94-202020|8|-7|fff7de-202020|7|-6|dec28c-202020|7|-3|d6ae63-202020|5|-2|dec284-202020|21|-3|ce9e4a-202020|20|-2|fff7de-202020|-17|-5|cea252-202020|-14|-1|fff7de-202020|-17|2|d6ae63-202020|-14|6|fff7de-202020|-16|8|fff7de-202020|-9|10|deba6b-202020|-3|8|d6b263-202020|-1|7|fffbe6-202020|1|7|fffbe6-202020|1|3|fffbe6-202020|2|-2|efdbad-202020|-7|-8|fff7de-202020|1|-4|ceaa5a-202020|-9|-2|fff7de-202020" , 0 , 0.9}
local 领取 = {493 , 197 , 982 , 587 , "fff7de-202020" , "4|1|f7f7de-202020|15|5|e6dbbd-202020|23|-12|bdae8c-202020|15|-13|ceba94-202020|13|4|cebe9c-202020|7|1|fffbe6-202020|17|0|fff7de-202020|12|-1|fff7de-202020|10|-12|fff7de-202020|-16|-13|c5b68c-202020|-19|-8|cec29c-202020|-14|-6|fff7de-202020|-13|-2|cec29c-202020|-6|0|bdaa84-202020|-6|1|fff7de-202020|-9|6|bdaa84-202020|-2|4|b5a27b-202020|-2|1|bdb28c-202020|-4|-11|f7f7de-202020|0|-14|b5a67b-202020|-10|-13|efefce-202020|-5|-11|fffbe6-202020|-14|-5|bdae84-202020|-15|-8|fff7de-202020" , 0 , 0.9}
local 分享 = {18 , 9 , 131 , 53 , "ffffbd-202020" , "-50|16|bda263-202020|-47|17|fff3c5-202020|-43|20|ffefbd-202020|-36|21|dece94-202020|-46|14|dec68c-202020|-49|12|dec68c-202020|29|12|ffffbd-202020|37|14|ffffbd-202020|31|4|ffffbd-202020|29|4|ffffbd-202020|24|3|a4a67b-202020|23|4|ffffbd-202020|-33|7|f7e7ad-202020|7|-2|ffffbd-202020|8|2|ffffbd-202020|8|3|b5b28c-202020|10|7|c5c294-202020|2|-1|ffffbd-202020|1|13|ffffbd-202020|7|17|ffffb5-202020|14|7|ffffbd-202020|-46|4|ffefb5-202020|-39|0|c5ae73-202020|-36|-6|cec28c-202020|-13|5|000000-202020" , 0 , 0.9}
local 前往 = {663 , 465 , 808 , 518 , "fff7de-202020" , "-5|1|e6ca94-202020|-4|1|fff3de-202020|-16|3|fff3de-202020|-15|5|fff7e6-202020|10|0|fff3de-202020|4|7|cea24a-202020|11|1|fff7de-202020|0|12|fff7de-202020|-1|15|d6a24a-202020|17|-2|fff3de-202020|13|5|fff7e6-202020|13|6|fff3de-202020|25|14|fff3de-202020|19|7|fff7e6-202020|24|6|fff3de-202020|19|4|fff3de-202020|25|-2|fff3de-202020|6|0|fff3de-202020|-14|-5|cea65a-202020|-14|-3|fff3de-202020|-18|-2|fff3de-202020|-2|-3|fff3de-202020|-2|-5|d6ba7b-202020|-10|-3|fff3de-202020" , 0 , 0.9}
local 关闭评分列表 = {1 , 167 , 40 , 324 , "080800-202020" , "-13|72|948e6b-202020|10|-22|947d4a-202020|-2|-9|635131-202020|-3|-8|a48652-202020|-3|-7|423519-202020|-4|-6|ad9252-202020|-4|-4|211c10-202020|-6|0|94814a-202020|-7|5|635529-202020|-9|10|73613a-202020|-6|5|524d31-202020|-5|4|948a52-202020|-4|2|3a2d21-202020|-1|-1|9c8e4a-202020|0|-2|312d19-202020|3|-3|080800-202020|11|-11|94814a-202020|14|-20|423519-202020|15|-21|94814a-202020|24|-80|4a4531-202020|24|69|6b693a-202020|23|71|84814a-202020|22|72|7b796b-202020|21|72|9c926b-202020" , 0 , 0.9}
local 选择地下城界面 = {9 , 7 , 173 , 48 , "ffefb5-202020" , "-79|-2|ffebb5-202020|25|5|e6d7ad-202020|28|-6|ffefb5-202020|36|-12|bdae94-202020|39|-10|fff3bd-202020|39|-9|ffefb5-202020|41|-8|fff3bd-202020|52|-12|ffefb5-202020|11|-11|ffefb5-202020|9|-9|fff3b5-202020|-14|2|ffefb5-202020|-21|-11|d6c69c-202020|-83|-12|fff3bd-202020|-90|-7|f7e7b5-202020" , 0 , 0.9}
local 入场65 = {765 , 569 , 1279 , 719 , "ffffff-202020" , "1|-7|e6d7b5-202020|1|-1|e6d7b5-202020|5|2|ffffff-202020|12|4|ffffff-202020|16|-12|ffffff-202020|5|-8|e6cea4-202020|12|3|f7efde-202020|-15|-7|d6b67b-202020|-16|-5|d6a65a-202020|-22|3|ffffff-202020|-12|-6|efe7d6-202020|-4|4|f7ebd6-202020|-8|-2|ffffff-202020|-12|-11|cea25a-202020" , 0 , 0.9}
local 入场652 = {811 , 568 , 1276 , 719 , "b57508-202020" , "3|1|efe3ce-202020|5|0|ffffff-202020|6|-3|ffffff-202020|7|5|efe3c5-202020|3|9|cea652-202020|12|7|ffffff-202020|13|3|ffffff-202020|12|2|ffffff-202020|10|-5|ad7100-202020|19|-4|ffffff-202020|22|-3|ad7100-202020|19|0|ad7100-202020|16|0|f7e7ce-202020|13|1|ffffff-202020|17|4|ffffff-202020|15|10|ffffff-202020|12|12|ffffff-202020|17|12|ffffff-202020|18|9|bd7900-202020|-12|-5|ffffff-202020|-14|-6|b57108-202020|-14|-3|ad7100-202020|-14|3|b57500-202020|-16|6|bd7900-202020|-14|12|bd7d08-202020|-8|5|b57500-202020|9|4|b57500-202020|-11|9|bd7900-202020|-8|9|b57900-202020|-8|11|bd7900-202020" , 0 , 0.9}
local 图色主线 = {68 , 165 , 116 , 186 , "e6ca42-101010" , "0|-1|e6ca42-101010|0|-2|efce42-101010|0|-3|e6ca42-101010|-1|-3|b59a31-101010|13|-3|c5aa3a-101010|12|-2|e6ca42-101010|12|-1|e6ca42-101010|11|-1|e6ca42-101010|11|0|e6ca42-101010|10|1|e6ca42-101010|10|2|e6ca42-101010|0|1|e6ca42-101010|-1|1|d6ba42-101010|0|5|e6ca42-101010|-5|5|efce42-101010|6|5|e6ca42-101010|7|11|efca42-101010|-6|11|e6ca42-101010|21|-2|e6ca42-101010|18|0|efca42-101010|17|1|efce42-101010|14|1|e6ca42-101010|26|-3|dec642-101010|29|-3|efce42-101010|27|13|efce42-101010|26|13|d6be3a-101010|23|12|e6ca42-101010|24|9|e6ca42-101010" , 0 , 0.9}

function 突破峡谷()
	setDict(0 , "主线相关.txt")
	useDict(0)
	local ret , x , y = findStr(1206 , 154 , 1275 , 172 , "突破峡谷" , "ffc600-303030" , 0.80 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		
		显示('-----------------突破峡谷-----------------')
		
		return true
	end
	return false
end
function 判断_突破峡谷_选择难度()
	setDict(0 , "主线相关.txt")
	useDict(0)
	for i = 1 , 5 do
		
		local ret , x , y = findStr(201 , 171 , 300 , 199 , "突破峡谷" , "f7e7a4-303030" , 0.9 , 10 , 10)
		
		local x1 , y1 = findMultiColor(369 , 323 , 422 , 684 , "efeb8c-202020" , "2|15|bdb208-202020|-5|16|d6c608-202020|-5|3|fff37b-202020|-7|12|ceb219-202020|3|2|efeb84-202020|5|2|ded773-202020|6|3|f7ef84-202020|5|2|ded773-202020|4|1|d6ca52-202020|4|0|c5ba5a-202020|-1|-1|bda63a-202020|6|-5|e6dbad-202020|-12|-5|f7e7b5-202020|-14|-3|deca8c-202020" , 0 , 0.9)
		
		if x ~= - 1 then
			
			显示('-----------------突破峡谷-----------------')
			sleep(1500)
			for i = 1 , 5 do
				
				if x1 ~= - 1 then
					return true
				end
				
				sleep(100)
			end
			
		end
		
		sleep(30)
	end
	
	return false
end
function 判断_机关图()
	setDict(0 , "主线相关.txt")
	useDict(0)
	local ret , x , y = findStr(1128 , 153 , 1215 , 172 , "托斯腾次元" , "ffc200-303030" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		
		显示('-----------------托斯藤次元-----------------')
		
		return true
	end
	
	local ret1 , x1 , y1 = findStr(1127 , 156 , 1184 , 171 , "古斯塔夫" , "ffc200-303030" , 0.8 , 10 , 10)
	if x1 ~= - 1 and y1 ~= - 1 then
		
		显示('-----------------古斯塔夫-----------------')
		
		return true
	end
	
	local ret2 , x2 , y2 = findStr(1124 , 148 , 1278 , 182 , "突破峡谷" , "ffc600-303030" , 0.8 , 10 , 10)
	if x2 ~= - 1 and y2 ~= - 1 then
		
		显示('-----------------突破峡谷-----------------')
		
		return true
	end
	
	local ret3 , x3 , y3 = findStr(1202 , 151 , 1279 , 176 , "城主宫殿" , "ffc200-303030" , 0.9 , 10 , 10)
	if x3 ~= - 1 and y3 ~= - 1 then
		
		显示('-----------------突破峡谷-----------------')
		
		return true
	end
	
	return false
	
end

function 判断_滚石监狱地图()
	setDict(0 , "主线相关.txt")
	useDict(0)
	local ret , x , y = findStr(1201 , 152 , 1276 , 174 , "滚石监狱" , "ffc200-303030" , 0.9 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then--10秒未通关重启游戏
		print('-----------------检测到滚石监狱-----------------')
		return true
	end
	return false
end
function 判断_输入数量_购买数量()
	local x , y = findMultiColor(1014 , 17 , 1138 , 55 , "c5ba8c-202020" , "52|8|ffefb5-202020|51|4|ada284-202020|19|-1|ffefb5-202020|19|12|fff3bd-202020|29|-5|bdb284-202020|19|6|fff3bd-202020|2|4|c5ba8c-202020|11|11|e6dba4-202020|-24|-10|ffefb5-202020|-38|-7|f7ebb5-202020|-39|8|fff3bd-202020|-30|6|ffefb5-202020|-35|-2|fff3bd-202020|-29|10|c5ba94-202020" , 0 , 0.9)
	if x ~= - 1 and y ~= - 1 then
		return true
	end
	return false
end

function 功能_购买材料_15个()
	local 输入数量 = false
	local 购买物品 = false
	local 开始时间 = os.time()
	while true do
		随机延时(900 , 1100)
		if os.time() - 开始时间 > 50 then
			return
		end
		显示('主线购买材料运行中')
		if 判断_购买物品界面() then
			
			if not 输入数量 then
				按下点击({974 , 476 , 1042 , 505})--输入数量
			elseif not 购买物品 then
				按下点击({871 , 616 , 1015 , 654})--购买物品
				购买物品 = true
			else
				初始化城镇界面()
				return
			end
			
		elseif 判断_输入数量_购买数量() then
			
			按下点击({937 , 493 , 992 , 547})--1
			随机延时(600 , 700)
			按下点击({1026 , 410 , 1076 , 463})--5
			随机延时(600 , 700)
			按下点击({1195 , 516 , 1249 , 632})--输入
			输入数量 = true
			
		elseif 入口_确认(true) then
			
		elseif 判断_城镇界面() or 快速检测游戏状态() then
			return
			
		end
		
	end
	
end

function 判断_任务_完成提示()
	setDict(0 , "字库3.txt")
	useDict(0)
	local ret , x , y = findStr(597 , 149 , 682 , 196 , "任务" , "e69a19-303030|c5a263-303030|d6ce7b-303030|ffffc5-303030" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		按下点击({584 , 325 , 687 , 377})
		return true
	end
	return false
end
function 判断_机关_主线()
	setDict(0 , "字库3.txt")
	useDict(0)
	local ret , x , y = findStr(1102 , 613 , 1182 , 687 , "机关" , "d6d784-303030|cece3a-303030|ad9219-303030" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		touchUp(0)
		sleep(10)
		touchUp(1)
		按下点击({1123 , 625 , 1164 , 674} , {1500 , 1700})
		return true
	end
	local ret1 , x1 , y1 = findStr(587 , 348 , 671 , 370 , "花在燃烧" , "ffffff-303030" , 0.8 , 10 , 10)
	if x1 ~= - 1 and y1 ~= - 1 then
		touchUp(0)
		sleep(10)
		touchUp(1)
		随机释放技能()
		return true
	end
	
	--[===[local ret2 , x2 , y2 = findStr(578 , 13 , 633 , 32 , "机关" , "42bed6-303030" , 0.8 , 10 , 10)
	if x2 ~= - 1 and y2 ~= - 1 then
	随机释放技能()
	return true
	end]===]
	return false
end

function 判断_等级70级()
	setDict(0 , "主线相关.txt")
	useDict(0)
	local ret , x , y = findStr(100 , 8 , 125 , 27 , "等级70" , "ffffff-202020" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then --左上角70特征
		
		if not 城镇主线() and not 判断_正在移动() then
			显示('等级70级且没有主线了')
			return true
			
		end
		
	end
	return false
end

function 判断_史诗_主线()
	setDict(0 , "字库3.txt")
	useDict(0)
	local ret , x , y = findStr(76 , 166 , 110 , 184 , "史诗" , "efca42-303030" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		
		显示('史诗(没有主线了)')
		return true
		
	end
	setDict(0 , "主线相关.txt")
	useDict(0)
	local ret1 , x1 , y1 = findStr(64 , 157 , 140 , 222 , "等级达成" , "ffffff-303030" , 0.8 , 10 , 10)
	if x1 ~= - 1 and y1 ~= - 1 then
		
		显示('等级达成(没有主线了)')
		return true
		
	end
	return false
end

function 判断_70级_没主线任务()
	
	setDict(0 , "字库3.txt")
	useDict(0)
	
	local ret , x , y = findStr(175 , 190 , 196 , 207 , "70级" , "ffffff-303030" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then --70级以上前往最后的地下城
		if not 城镇主线() and not 判断_正在移动() then
			显示('70级以上可领任务')
			return true
			
		end
	end
	return false
end

function 判断_68级_没主线任务()
	
	setDict(0 , "字库3.txt")
	useDict(0)
	for i = 1 , 5 do
		local ret , x , y = findStr(175 , 190 , 196 , 207 , "68级" , "ffffff-303030" , 0.8 , 10 , 10)
		if x ~= - 1 and y ~= - 1 then
			
			显示('68级以上可领任务')
			return true
			
		end
		local ret1 , x1 , y1 = findStr(87 , 165 , 136 , 189 , "70级" , "ffe773-303030" , 0.8 , 10 , 10)
		if x1 ~= - 1 and y1 ~= - 1 then --70级以上前往最后的地下城
			显示('70级以上前往最后的地下城')
			return true
			
		end
		
		local ret2 , x2 , y2 = findStr(175 , 190 , 196 , 207 , "70级" , "ffffff-303030" , 0.8 , 10 , 10)
		if x2 ~= - 1 and y2 ~= - 1 then --70级以上前往最后的地下城
			显示('70级以上前往最后的地下城2')
			return true
			
		end
		sleep(100)
	end
	
	return false
	
end

function 判断_55级_没主线()
	setDict(0 , "字库3.txt")
	useDict(0)
	for i = 1 , 5 do
		local ret , x , y = findStr(91 , 167 , 136 , 187 , "55级" , "ffe773-303030" , 0.8 , 10 , 10)
		if x ~= - 1 and y ~= - 1 then
			显示('55级以上可领任务')
			return true
		end
		
		sleep(100)
	end
	
	return false
	
end

function 判断_副本入场抗磨不足()
	
	local ret = cmpColorEx("1121|676|ffffff-202020,1118|684|ffffff-202020,1117|684|e6e7e6-202020,1122|686|ffffff-202020,1127|680|adaead-202020,1128|687|a4a6a4-202020,1130|674|ffffff-202020,1129|674|ffffff-202020,1121|675|ffffff-202020,1131|679|ffffff-202020,1128|686|ffffff-202020,1125|678|ffffff-202020,1104|675|ffffff-202020,1102|683|c5cac5-202020,1102|670|ffffff-202020,1110|673|737573-202020,1112|678|7b797b-202020,1111|669|7b757b-202020,1106|683|7b7d7b-202020,1123|681|847d84-202020" , 0.9)
	
	if ret == 1 then
		显示('进入副本抗磨不足')
		if 判断_选择地下城界面() then
			return true
		end
		
	end
	return false
end

function 功能_最后的地下城()
	local 冷却点击 = 0
	while true do
		快速检测游戏状态()
		
		随机延时(700 , 800)
		显示('最后的地图升级中')
		if 判断_城镇界面() then
			
			if 判断_疲劳值为0() or 判断_主线() or 城镇主线() then
				
				return
				
			end
			
			if os.time() - 冷却点击 > 10 then
				
				if 判断_史诗_主线() then
					
					按下点击({70 , 163 , 229 , 211})
				end
			end
			
		elseif 判断_前往_最后的地下城() then
			
			冷却点击 = os.time()
		elseif 判断_副本入场抗磨不足() then
			
			return
			
		elseif 判断_可开燃烧交易界面() then
			
			if 判断_副本不可入场() then
				
				return 副本2_卡勒特司令部()
			end
			
			按下点击({1061 , 615 , 1184 , 658}) --战斗开始
		elseif 判断_加载界面() then
			
		elseif 判断_副本中() then
			自动刷图主线()
			
		elseif 判断_返回城镇() then
			
			功能_返回城镇界面获取疲劳值()
			
			if 功能_获取疲劳值() == 0 then
				
				入口_返回城镇()
				
			else
				if 入口_再次挑战() then
					
				else
					入口_返回城镇()
					
				end
				
			end
		elseif 主线_入场65() then
			显示('主线65入场')
		else
			清屏(true)
			
		end
		
	end
	
end

function 判断_获取途径_主线()
	
	local x , y = findMultiColor(579 , 80 , 703 , 108 , "fff3bd-202020" , "17|4|ffefb5-202020|6|12|fff3bd-202020|-55|-4|ffefb5-202020|-51|2|ffefb5-202020|-51|5|fff3bd-202020|-32|11|c5be8c-202020|-15|-6|ffefb5-202020|34|-10|d6c69c-202020|41|-5|c5b68c-202020|39|-3|fff3bd-202020|-21|3|fff3bd-202020|-21|7|fff3bd-202020|6|-3|ffefb5-202020|14|8|fff3bd-202020|14|-1|ffefb5-202020|14|-2|fff3bd-202020|9|-5|fff3bd-202020|3|-6|d6ca9c-202020|-47|-6|ffefb5-202020" , 0 , 0.9)
	local x1 , y1 = findMultiColor(873 , 82 , 903 , 112 , "9c927b-202020" , "-11|-14|948673-202020|-11|-12|8c816b-202020|-1|-2|ad9a84-202020|-1|-1|ad9a84-202020|-11|9|ad9684-202020|-11|10|ad9e84-202020|-10|10|9c8e7b-202020|2|0|b5a28c-202020|3|2|8c816b-202020|4|2|b5a28c-202020|5|3|b5a28c-202020|5|4|8c7d6b-202020|10|8|ada284-202020|11|9|b5a28c-202020|11|10|8c7d6b-202020|2|-1|ad9e84-202020|2|-2|ad9e8c-202020|1|-3|ad9e84-202020|0|-3|ad9e84-202020" , 0 , 0.9)
	if x ~= - 1 and y1 ~= - 1 then
		
		return true
	end
	return false
end

function 判断_购买物品_主线拍卖行()
	
	local x , y = findMultiColor(583 , 49 , 697 , 84 , "ffefb5-202020" , "63|-7|ffefb5-202020|49|2|fff3bd-202020|55|3|ffefb5-202020|-5|-12|fff3bd-202020|-21|-12|fff3bd-202020|-21|-3|b5aa8c-202020|-22|-6|ffefb5-202020|-31|-15|d6ca9c-202020|2|1|ada684-202020|-7|-20|ffefbd-202020|28|-12|ffefb5-202020|36|-6|ffefb5-202020|35|3|ded2a4-202020|27|-15|ffefb5-202020|-23|-16|fff3bd-202020|-24|-14|ffefb5-202020|-34|-5|fff3bd-202020|-26|-5|fff3bd-202020|-12|-17|fff3bd-202020" , 0 , 0.9)
	local x1 , y1 = findMultiColor(894 , 622 , 998 , 653 , "e6ce9c-202020" , "37|6|deaa52-202020|-8|-9|fff3de-202020|-6|-8|fff3de-202020|-3|-7|d6aa5a-202020|-12|-1|efd2a4-202020|47|-6|d6a252-202020|45|-10|fff7de-202020|11|-10|ffefd6-202020|13|6|e6be7b-202020|22|5|fff3de-202020|14|-10|fff3de-202020|19|-6|ce9e4a-202020|16|-3|fff3de-202020|20|-7|fff3de-202020|-30|4|d6aa52-202020|-29|2|fff7e6-202020|-26|-1|fff3de-202020|-16|-2|e6d2a4-202020|-29|-8|fff7de-202020" , 0 , 0.9)
	if x ~= - 1 and y1 ~= - 1 then
		
		return true
	end
	return false
end

function 判断_打开任务界面()
	
	setDict(0 , "主线相关.txt")
	useDict(0)
	local ret , x , y = findStr(9 , 1 , 153 , 49 , "打开任务界面" , "ffefb5-303030" , 0.8 , 10 , 10)
	
	if x ~= - 1 then
		显示('打开任务界面')
		return true
	end
	return false
	
end
function 判断_打开任务详细界面()
	setDict(0 , "主线相关.txt")
	useDict(0)
	local ret , x , y = findStr(559 , 51 , 667 , 87 , "任务详细" , "ffefb5-303030" , 0.85 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		print('打开任务详细界面')
		return true
	end
	return false
end

function 判断_第四赛季()
	setDict(0 , "主线相关.txt")
	useDict(0)
	local ret , x , y = findStr(835 , 204 , 1279 , 263 , "第4" , "e6ba84-303030" , 0.85 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		显示('第四赛季')
		return true
	end
	return false
	
end
function 判断_任务未解锁()
	setDict(0 , "主线相关.txt")
	useDict(0)
	local ret , x , y = findStr(194 , 217 , 1279 , 674 , "任务未解锁" , "636563-202020" , 0.85 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		显示('任务未解锁')
		return true
	end
	return false
end

function 判断_希洛克的原因()
	setDict(0 , "主线相关.txt")
	useDict(0)
	
	for i = 1 , 5 do
		local ret , x , y = findStr(410 , 565 , 488 , 587 , "克的原因" , "e6ca42-303030" , 0.85 , 10 , 10)
		if x ~= - 1 and y ~= - 1 then
			
			return true
		end
		
		sleep(100)
	end
	
	return false
	
end

function 判断_再次入场_成就()
	
	local x , y = findMultiColor(847 , 626 , 926 , 648 , "bdb284-202020" , "20|12|8c8163-202020|29|2|dece9c-202020|40|-1|9c9273-202020|-11|13|f7ebb5-202020|1|10|8c8163-202020|-32|-4|d6ca9c-202020|10|-4|b5a67b-202020|29|10|cec294-202020|13|5|84795a-202020|-19|12|bdb284-202020|-12|-2|8c8663-202020|-5|9|8c8163-202020|-30|9|948a6b-202020|-11|6|d6ca9c-202020|-25|-1|ada67b-202020|37|13|ada67b-202020|-31|3|736d52-202020|28|-5|736d52-202020|34|-4|a49a73-202020|37|5|d6ca9c-202020|-6|0|b5a67b-202020" , 0 , 0.9)
	if x ~= - 1 and y ~= - 1 then
		按下点击(x , y)
		return true
	end
	return false
end

function 判断_最后的希望()
	setDict(0 , "主线相关.txt")
	useDict(0)
	local ret , x , y = findStr(292 , 176 , 411 , 586 , "最后的希望" , "e6ca42-303030" , 0.85 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		
		print('判断_最后的希望')
		按下点击(x , y , - 1 , 10 , - 1 , 1)
		
		return true
	end
	return false
end
function 判断_疯狂同道者()
	setDict(0 , "主线相关.txt")
	useDict(0)
	local ret , x , y = findStr(292 , 176 , 411 , 586 , "疯狂同道者" , "e6ca42-303030" , 0.85 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		print('判断_疯狂同道者')
		按下点击(x , y , - 1 , 10 , - 1 , 1)
		return true
	end
	return false
end
function 判断_恐惧之名()
	setDict(0 , "主线相关.txt")
	useDict(0)
	local ret , x , y = findStr(292 , 176 , 411 , 586 , "恐惧之名" , "e6ca42-303030" , 0.85 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		print('判断_恐惧之名')
		按下点击(x , y , - 1 , 10 , - 1 , 1)
		return true
	end
	return false
	
end
function 判断_生命的种子()
	setDict(0 , "主线相关.txt")
	useDict(0)
	local ret , x , y = findStr(292 , 176 , 411 , 586 , "生命的种子" , "e6ca42-303030" , 0.85 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		print('判断_生命的种子')
		按下点击(x , y , - 1 , 10 , - 1 , 1)
		return true
	end
	return false
	
end

function 判断_完成过去任务_主线最下()
	setDict(0 , "字库3.txt")
	useDict(0)
	local ret , x , y = findStr(296 , 493 , 371 , 519 , "完成过去" , "ffefb5-303030|d6c69c-303030" , 0.8 , 1 , 10)
	
	if x ~= - 1 and y ~= - 1 then
		按下点击(x , y , - 1 , 20 , - 1 , 5)
		return true
	end
	return false
end

function 判断_防具选择界面()
	local x = - 1
	local y = - 1
	x , y = findMultiColor(546 , 134 , 731 , 159 , "2f261f-202020" , "-24|-10|f4c183-202020|-62|10|2d2620-202020|-85|-6|81684a-202020|-44|3|312923-202020|88|-5|f4c183-202020|48|-10|f4c183-202020|35|0|ba9366-202020|-72|-14|322924-202020|-78|-3|f4c183-202020|7|-9|a3825b-202020|61|5|b59064-202020|75|-9|352a24-202020|74|2|312723-202020|46|0|302822-202020|50|-5|322a24-202020|41|-5|332b24-202020|17|-5|332b24-202020" , 0 , 0.9)
	if x ~= - 1 and y ~= - 1 then
		if not 判断_副本中() or not 判断_城镇界面() then
			显示('选择防具')
			
			按下点击(868 , 229)
			随机延时(400 , 600)
			按下点击({560 , 604 , 726 , 647})--确认
			if 入口_确认() then
				随机延时(400 , 600)
			end
			return true
		end
		
	end
	return false
end

function 判断_地区移动码头()
	
	local x , y = findMultiColor(993 , 22 , 1165 , 59 , "ffefb5-202020" , "12|-1|fff3bd-202020|4|8|ffefb5-202020|17|14|fff3bd-202020|44|16|ffefb5-202020|31|5|ffefb5-202020|31|10|3a3129-202020|75|8|3a3529-202020|74|2|ffefb5-202020|60|23|fff3bd-202020|98|12|3a3121-202020|121|6|3a3129-202020|113|21|ffefb5-202020|113|1|ffefb5-202020|137|-1|3a3121-202020|133|21|ded2a4-202020|153|21|ffefb5-202020|136|1|635542-202020|137|0|fff3bd-202020|136|4|3a3129-202020|132|1|423529-202020|131|18|3a2d21-202020|130|23|312821-202020|118|20|312d21-202020" , 0 , 0.9)
	if x ~= - 1 and y ~= - 1 then
		--按下点击({979 , 190 , 1231 , 234})
		if 获取设备类型() == 0 then
			
			滑动(204 , 523 , 207 , 681 , 5 , 5 , {10 , 35} , {700 , 800})
		else
			拖动轮盘_自定义(466 , 561 , 700 , 800)
		end
		
		return true
	end
	return false
end
function 判断_绿都 ()
	
	--local x , y = findMultiColor(1170 , 78 , 1186 , 96 , "5aff00-202020" , "9|-2|d6be7b-202020|9|4|d6ba7b-202020|12|4|d6b673-202020|12|-2|d6b673-202020|3|-2|5aff00-202020|-1|0|63ff00-202020|-3|1|5aff00-202020|-3|2|63ff00-202020|-2|2|5aff00-202020|-1|3|5aff00-202020|0|3|5aff00-202020|1|4|63ff00-202020|3|5|5aff00-202020|4|5|5aff00-202020" , 0 , 0.92)
	local x2 , y2 = findMultiColor(1171 , 151 , 1276 , 173 , "ffc200-202020" , "6|10|ffc200-202020|19|9|efb600-202020|22|5|ffc200-202020|-9|5|ffc200-202020|-9|-1|ffc200-202020|-28|0|ffc200-202020|-31|6|ffc600-202020|-29|2|ffc600-202020|-26|2|ffc200-202020|40|9|ffc200-202020|38|10|ffc200-202020|2|-4|ffc200-202020|1|-3|f7be00-202020|6|-2|ffc200-202020" , 0 , 0.92)
	if x2 ~= - 1 then
		if 获取设备类型() == 0 then
			滑动(202 , 522 , 21 , 527 , 5 , 5 , {15 , 30} , {200 , 300} , {2000 , 3000})
			滑动(202 , 522 , 437 , 517 , 5 , 5 , {15 , 30} , {200 , 300} , {700 , 800})
		else
			拖动轮盘_自定义多点(28 , 572 , 71 , 570 , 200 , 300 , 2000 , 3000)
			拖动轮盘_自定义多点(547 , 565 , 558 , 560 , 200 , 300 , 2000 , 3000)
		end
		
		return true
	end
	return false
end
function 判断_容颜洞穴()
	--[===[local x , y = findMultiColor(1192 , 104 , 1210 , 120 , "63ff00-202020" , "-3|-5|5aff00-202020|-2|-4|63ff00-202020|-2|-2|5ae700-202020|0|1|5aff00-202020|1|2|5aff00-202020|1|3|5aff00-202020|2|3|5aff00-202020|2|2|5aff00-202020|3|1|5aff00-202020|3|0|5aff00-202020|4|-1|5aff00-202020|4|-2|5aff00-202020|5|-4|52ff00-202020|6|-5|5aff00-202020" , 0 , 0.9)
	local x2 , y2 = findMultiColor(1221 , 152 , 1276 , 173 , "ffc600-202020" , "24|1|deaa00-202020|17|4|ffc200-202020|18|4|ffc600-202020|-3|5|ffc200-202020|-2|5|ffc200-202020|-12|8|ffc600-202020|-8|3|efb600-202020|-12|-2|ffc200-202020|-20|-2|f7ba00-202020|26|-3|ffc200-202020|28|-1|ffc200-202020|4|-4|ffc600-202020|-17|0|ffc200-202020|-10|-6|f7be00-202020" , 0 , 0.9)
	if x ~= - 1 and y ~= - 1 and x2 ~= - 1 and y2 ~= - 1 then
	
	滑动(202 , 522 , 431 , 522 , 5 , 5 , {15 , 30} , {200 , 300} , {1500 , 2000})
	滑动(202 , 522 , 12 , 519 , 5 , 5 , {15 , 30} , {200 , 300} , {1500 , 2000})
	return true
	end]===]
	local x , y = findMultiColor(1220 , 154 , 1278 , 173 , "ffc200-202020" , "27|1|deaa00-202020|17|8|ffc600-202020|20|5|ffc200-202020|21|4|ffc600-202020|0|5|ffc200-202020|3|9|ffc200-202020|4|3|ffc200-202020|4|2|ffc200-202020|-12|0|efb600-202020|-16|6|ffc200-202020|-15|4|ffc600-202020|-3|-3|ffc200-202020|-6|-4|ffc200-202020|-15|-2|ffc600-202020|13|-6|846500-202020|18|-4|b58e00-202020|31|-4|8c6900-202020|29|5|6b5100-202020|31|7|735900-202020|13|5|ffc200-202020|12|5|c59a00-202020|15|0|634d00-202020" , 0 , 0.92)
	if x ~= - 1 and y ~= - 1 then --容颜洞穴
		if 获取设备类型() == 0 then
			滑动(202 , 522 , 431 , 522 , 5 , 5 , {15 , 30} , {200 , 300} , {1500 , 2000})
			滑动(202 , 522 , 12 , 519 , 5 , 5 , {15 , 30} , {200 , 300} , {1500 , 2000})
		else
			拖动轮盘_自定义多点(515 , 563 , 550 , 555 , 200 , 300 , 1500 , 2000)
			拖动轮盘_自定义多点(74 , 574 , 14 , 573 , 200 , 300 , 1500 , 2000)
		end
		
		return true
	end
	
	return false
end
function 判断_孵化场()
	
	local x , y = findMultiColor(1166 , 78 , 1182 , 94 , "63ff00-202020" , "4|-7|5aff00-202020|1|-5|5aff00-202020|-1|-4|5aff00-202020|-4|-3|5aff00-202020|-4|-2|63ff00-202020|-2|-1|5aff00-202020|1|0|5aff00-202020|2|1|5aff00-202020|4|2|5aff00-202020|9|-3|d6ba7b-202020" , 0 , 0.9)
	local x2 , y2 = findMultiColor(1154 , 152 , 1275 , 174 , "ffc200-202020" , "-54|2|ffc200-202020|26|-2|ffc200-202020|-13|4|efb600-202020|-20|-4|ffc200-202020|-49|-2|ffc200-202020|17|6|ffc200-202020|12|-5|ffc200-202020|47|-4|ffc200-202020|52|-3|ffc600-202020|43|-6|ffc200-202020|0|-7|ffc600-202020|7|-6|ffc200-202020|-14|-6|deae00-202020|-8|-8|ffc200-202020" , 0 , 0.9)
	
	if x ~= - 1 and y ~= - 1 and x2 ~= - 1 and y2 ~= - 1 then
		if 获取设备类型() == 0 then
			滑动(202 , 522 , 21 , 527 , 5 , 5 , {15 , 30} , {200 , 300} , {1000 , 2000})
		else
			拖动轮盘_自定义多点(74 , 574 , 14 , 573 , 200 , 300 , 1500 , 2000)
		end
		
		return true
	end
	return false
end
function 判断_浅溪之地()
	
	local x , y = findMultiColor(1216 , 78 , 1234 , 96 , "52ff00-202020" , "-9|-1|d6ba7b-202020|-7|5|d6b673-202020|-7|-1|d6ba73-202020|-3|-2|5aff00-202020|-3|7|5aff00-202020|-2|6|5aff00-202020|1|5|5aff00-202020|3|4|63ff00-202020|5|3|5aff00-202020|5|2|63ff00-202020|4|2|5aff00-202020|2|1|5aff00-202020|-1|-1|5aff00-202020|-2|-1|5aff00-202020" , 0 , 0.9)
	
	local x2 , y2 = findMultiColor(1206 , 152 , 1277 , 172 , "deaa00-202020" , "-21|4|ffc200-202020|-21|0|ffc200-202020|-1|-1|ffc200-202020|6|4|ffc200-202020|2|-4|ffc200-202020|30|0|ffc200-202020|41|1|ffc600-202020|41|-3|ffc600-202020|19|2|ffc200-202020|-17|1|ffbe00-202020|-16|7|f7c200-202020|-14|3|ffc200-202020|-9|0|f7be00-202020|-12|-3|f7be00-202020" , 0 , 0.9)
	if x ~= - 1 and y ~= - 1 and x2 ~= - 1 and y2 ~= - 1 then
		if 获取设备类型() == 0 then
			滑动(202 , 522 , 399 , 529 , 5 , 5 , {15 , 30} , {200 , 300} , {1000 , 2000})
		else
			拖动轮盘_自定义多点(515 , 563 , 550 , 555 , 200 , 300 , 1500 , 2000)
		end
		
		return true
	end
	return false
	
end

function 主线_选择地下城界面()
	local x , y = findMultiColorT(选择地下城界面)
	if x ~= - 1 and y ~= - 1 then
		
		return true
	end
	return false
	
end
function 主线_入场65()
	
	setDict(0 , "主线相关.txt")
	useDict(0)
	
	local ret , x , y = findStr(767 , 579 , 1268 , 719 , "入场" , "ffffff-303030" , 0.85 , 10 , 10)
	local x1 , y1 = findMultiColor(1051 , 655 , 1276 , 710 , "7b797b-202020" , "-1|4|737573-202020|-2|-4|7b757b-202020|13|-5|737573-202020|29|2|737573-202020|25|16|7b7d7b-202020|7|22|848184-202020|-11|18|7b817b-202020|-23|8|7b797b-202020" , 0 , 0.9)
	if x ~= - 1 and x1 == - 1 then
		显示('65入场')
		按下点击(x , y , - 15 , 20 , - 15 , 15)
		return true
	end
	
	return false
end
function 判断_关闭评分列表()
	local x , y = findMultiColorT(关闭评分列表)
	if x ~= - 1 and y ~= - 1 then
		显示('关闭评分列表')
		随机延时(400 , 600)
		按下点击({8 , 204 , 35 , 291})
		return true
	end
	return false
	
end

function 判断_前往()
	
	local x , y = findMultiColorT(前往)
	if x ~= - 1 and y ~= - 1 then
		显示('前往')
		随机延时(400 , 600)
		按下点击({664 , 468 , 805 , 516})
		return true
	end
	return false
end

function 判断_前往_最后的地下城()
	
	local x , y = findMultiColor(610 , 212 , 669 , 245 , "ffefb5-202020" , "24|4|ffefb5-202020|27|7|ffefb5-202020|16|1|fff3bd-202020|17|2|bdae8c-202020|17|14|efe3ad-202020|-9|1|ffefb5-202020|-15|2|fff3bd-202020|-14|5|fff3bd-202020|-5|4|fff3bd-202020|-5|12|fff3bd-202020|-9|6|fff3bd-202020|-9|11|ffefb5-202020|4|12|ffefb5-202020|-14|-8|ffefb5-202020" , 0 , 0.9)
	local x1 , y1 = findMultiColor(610 , 379 , 730 , 401 , "efe3ad-202020" , "-36|4|bdb28c-202020|-45|-3|ffefb5-202020|-71|1|ffefb5-202020|-56|3|fff3bd-202020|-59|-11|ded7a4-202020|37|1|ffefb5-202020|45|-1|ada27b-202020|43|-2|fff3bd-202020|44|-7|f7ebb5-202020|30|-11|fff3bd-202020|38|0|ffefb5-202020|36|0|ffefb5-202020|-6|-8|ffefb5-202020|-26|-3|fff3bd-202020" , 0 , 0.9)
	if x ~= - 1 and y ~= - 1 then
		按下点击({660 , 454 , 809 , 501})--前往
		return true
	end
	return false
end

function 判断_分享()
	local x , y = findMultiColorT(分享)
	if x ~= - 1 and y ~= - 1 then
		显示('分享')
		随机延时(400 , 600)
		按下点击({32 , 26 , 54 , 39})
		return true
	end
	return false
end
function 判断_领取()
	local x , y = findMultiColorT(领取)
	if x ~= - 1 and y ~= - 1 then
		显示('领取')
		随机延时(400 , 600)
		按下点击(x , y , - 54 , 54 , - 20 , 20)
		return true
	end
	return false
	
end

function 判断_报告()
	
	local x , y = findMultiColorT(报告)
	if x ~= - 1 and y ~= - 1 then
		显示('报告')
		随机延时(400 , 600)
		按下点击({840 , 230 , 920 , 267} , {50 , 400})--自动配置
		return true
	end
	return false
	
end
function 判断_装备_消耗品()
	local x , y = findMultiColor(1116 , 593 , 1232 , 630 , "f7efde-202020" , "-13|-10|ffffff-202020|-13|-3|ffffff-202020|-10|4|dec28c-202020|1|4|d6aa5a-202020|13|-6|ffffff-202020|14|-7|ffffff-202020|1|-6|ffffff-202020|-8|-10|c5a25a-202020|7|1|d6ae6b-202020|9|3|ffffff-202020|-6|-1|ffffff-202020|-7|2|d6aa5a-202020|-9|2|ffffff-202020|-9|1|ffffff-202020|10|-1|d6aa63-202020|7|0|ffffff-202020|9|-8|debe8c-202020|13|-7|ffffff-202020|-3|-8|ffffff-202020|3|-10|ad7100-202020|1|-11|ad6d00-202020|-2|-11|e6d7bd-202020|5|-11|ad6d00-202020|2|1|bd7900-202020|-5|4|c57d00-202020|-16|-3|b57500-202020|20|-1|b57900-202020|18|-6|ad7500-202020" , 0 , 0.9)
	if x ~= - 1 and y ~= - 1 then
		显示('副本:装备')
		按下点击({1130 , 599 , 1226 , 629})
		随机延时(500 , 700)
		return true
	end
	local x1 , y1 = findMultiColor(1116 , 593 , 1232 , 630 , "ffffff-202020" , "10|1|e6d2ad-202020|11|2|dec28c-202020|13|3|ffffff-202020|9|-1|cea65a-202020|-7|1|ffffff-202020|-10|9|ffffff-202020|0|-3|ffffff-202020|-7|-6|ffffff-202020|-8|-3|ffffff-202020|3|0|b57500-202020|2|-7|ad6d00-202020|-15|-6|ad7100-202020|-17|0|b57500-202020|-13|2|b57500-202020|1|7|bd7900-202020|11|6|bd7900-202020|13|-1|ad7100-202020" , 0 , 0.9)
	if x1 ~= - 1 and y1 ~= - 1 then
		显示('副本:学习')
		按下点击({1130 , 599 , 1226 , 629})
		随机延时(500 , 700)
		return true
	end
	
	local x3 , y3 = findMultiColor(738 , 460 , 1172 , 517 , "cea24a-202020" , "18|6|fff3de-202020|19|7|d6ae5a-202020|15|-8|d6ae6b-202020|12|-6|fff3de-202020|-11|-8|d6ae6b-202020|-11|-6|fff7de-202020|-15|-1|cea652-202020|-2|-11|fff7de-202020|-4|3|fff7de-202020|4|-9|ad7100-202020|3|1|b57900-202020|-3|5|bd7d00-202020|-16|-5|b57500-202020|24|-2|b57500-202020|13|-3|ad7500-202020|0|-7|b57108-202020" , 0 , 0.9)
	if x3 ~= - 1 and y3 ~= - 1 then
		显示('城镇:装备')
		按下点击({1045 , 470 , 1136 , 506})
		随机延时(500 , 700)
		return true
	end
	
	local x4 , y4 = findMultiColor(738 , 460 , 1172 , 517 , "f7e3bd-202020" , "4|0|f7e7c5-202020|-24|-2|fff3de-202020|-19|5|fff3de-202020|-16|2|fff3de-202020|5|-7|f7e3bd-202020|5|5|fff3de-202020|0|7|fff7de-202020|-14|-9|fff3de-202020|-19|-7|f7ebce-202020|-21|-1|bd7d10-202020|-10|-1|b57500-202020|-9|-5|ad7100-202020|-10|-9|ad6d00-202020|-14|5|bd7d00-202020|-5|5|bd7d00-202020|2|-5|b57100-202020" , 0 , 0.9)
	if x4 ~= - 1 and y4 ~= - 1 then
		显示('城镇:学习')
		按下点击({1045 , 470 , 1136 , 506})
		随机延时(500 , 700)
		return true
	end
	--[===[local x5 , y5 = findMultiColor(1041 , 468 , 1136 , 505 , "fff3de-202020" , "12|0|d6ae6b-202020|12|-3|d6aa63-202020|0|-5|fff3de-202020|-9|9|e6be7b-202020|-5|3|e6ca94-202020|-9|-6|d6aa63-202020|-10|-8|dec28c-202020|-6|1|fff7de-202020|-11|0|fff7e6-202020|-5|-8|ad6d08-202020|-3|-2|b57500-202020|-4|5|bd7900-202020|-17|5|bd7900-202020|-17|-2|b57500-202020|-24|-4|ad7100-202020|-23|6|bd7d00-202020|17|3|b57900-202020|17|-4|b57108-202020|3|7|bd7d00-202020" , 0 , 0.9)
	if x5 ~= - 1 and y5 ~= - 1 then
	显示('城镇:使用')
	按下点击(1152 , 314)
	随机延时(500 , 700)
	return true
	end]===]
	
	return false
	
end

function 判断_正在移动()
	setDict(0 , "字库0.txt")
	useDict(0)
	local ret , x , y = findStr(66 , 161 , 156 , 218 , "正在移动" , "ffc600-202020|ad8100-202020|deae00-202020" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		显示('ocr正在移动')
		return true
	end
	
	local ret2 , x2 , y2 = findStr(69 , 246 , 158 , 272 , "正在移动" , "ffc600-202020|ad8100-202020|deae00-202020" , 0.8 , 10 , 10)
	if x2 ~= - 1 and y2 ~= - 1 then
		显示('ocr正在移动2')
		return true
	end
	setDict(0 , "主线相关.txt")
	useDict(0)
	local ret3 , x3 , y3 = findStr(61 , 158 , 269 , 279 , "正在移动" , "f7a200-303030" , 0.8 , 10 , 10)
	if x3 ~= - 1 and y3 ~= - 1 then
		显示('ocr正在移动3')
		return true
	end
	
	return false
end

function 判断_技能配置()
	local x , y = findMultiColorT(技能配置)
	if x ~= - 1 and y ~= - 1 then
		显示('技能配置(地下城)')
		随机延时(400 , 600)
		
		return true
	end
	
	local x1 , y1 = findMultiColor(486 , 39 , 783 , 76 , "c0b58b-202020" , "-100|10|ede0ac-202020|-114|3|fff1b9-202020|93|0|faedb6-202020|91|6|ede0ac-202020|9|0|eadda9-202020|-49|-4|fff1b9-202020|-77|-8|ecdfab-202020|118|11|fff1b9-202020|119|5|f1e4af-202020|106|-3|fff1b9-202020|32|0|fff1b9-202020|26|10|fff1b9-202020|-125|13|b9af86-202020|-126|0|fff1b9-202020" , 0 , 0.9)
	if x1 ~= - 1 and y1 ~= - 1 then
		显示('技能配置(排位赛)')
		随机延时(400 , 600)
		return true
	end
	return false
end
function 判断_异闻录()
	
	setDict(0 , "主线相关.txt")
	useDict(0)
	
	local ret , x , y = findStr(61 , 156 , 136 , 274 , "异闻录" , "f7a200-303030" , 0.8 , 10 , 10)
	if x ~= - 1 then
		print('异闻录')
		按下点击(x , y , - 5 , 50 , - 3 , 5)
		随机延时(400 , 600)
		
		return true
	end
	
	sleep(80)
	
	return false
end
function 主线_觉醒()
	setDict(0 , "主线相关.txt")
	useDict(0)
	local ret , x , y = findStr(65 , 161 , 118 , 190 , "觉醒" , "bd51e6-303030" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		显示('点击主线')
		按下点击({82 , 164 , 271 , 214})
		return true
	end
	
	return false
end

function 判断_主线()
	setDict(0 , "字库0.txt")
	useDict(0)
	local ret , x , y = findStr(76 , 167 , 110 , 183 , "主线" , "e6ca42-202020|b59a31-202020" , 0.85 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		显示('点击主线')
		按下点击({82 , 164 , 271 , 214})
		return true
	end
	
	if 判断_异闻录() then
		随机延时(400 , 600)
		return true
	end
	if 主线_觉醒() then
		随机延时(400 , 600)
		return true
	end
	return false
end

function 城镇主线()
	
	for i = 1 , 5 do
		
		setDict(0 , "字库2.txt")
		useDict(0)
		
		local ret4 , x4 , y4 = findStr(75 , 166 , 110 , 184 , "转" , "c651ef-202020|b549d6-202020" , 0.85 , 10 , 10)
		if x4 ~= - 1 and y4 ~= - 1 then
			显示('转职1')
			按下点击({84 , 172 , 238 , 207})--点击任务
			随机延时(400 , 600)
			return true
		end
		
		local ret5 , x5 , y5 = findStr(76 , 166 , 110 , 184 , "转职" , "c651ef-202020|b549de-202020" , 0.85 , 10 , 10)
		if x5 ~= - 1 and y5 ~= - 1 then
			显示('转职2')
			按下点击({84 , 172 , 238 , 207})--点击任务
			随机延时(400 , 600)
			return true
		end
		
		setDict(0 , "字库0.txt")
		useDict(0)
		local ret , x , y = findStr(60 , 155 , 123 , 224 , "主线" , "efcb42-202020" , 0.85 , 10 , 10)
		if x ~= - 1 and y ~= - 1 then
			print('主线1')
			按下点击({71 , 165 , 156 , 189})
			随机延时(400 , 600)
			return true
		end
		
		setDict(0 , "字库3.txt")
		useDict(0)
		local ret6 , x6 , y6 = findStr(60 , 155 , 123 , 224 , "主线" , "e8cb42-303030" , 0.85 , 10 , 10)
		if x6 ~= - 1 and y6 ~= - 1 then
			print('主线1')
			按下点击({71 , 165 , 156 , 189})
			随机延时(400 , 600)
			return true
		end
		
		setDict(0 , "主线相关.txt")
		useDict(0)
		local ret7 , x7 , y7 = findStr(60 , 155 , 123 , 224 , "主线" , "e8cb42-303030" , 0.85 , 10 , 10)
		
		if x7 ~= - 1 and y7 ~= - 1 then
			print('主线7')
			按下点击({71 , 165 , 156 , 189})
			随机延时(400 , 600)
			return true
		end
		if 主线_觉醒() then
			随机延时(400 , 600)
			return true
		end
		
		sleep(100)
	end
	
	return false
	
end
function 判断_所有任务_主线()
	setDict(0 , "主线相关.txt")
	useDict(0)
	--[===[local ret , x , y = findStr(67 , 170 , 152 , 192 , "名望" , "ff81c5-303030" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
	
	显示('名望任务')
	按下点击(x , y , - 1 , 120 , - 1 , 1)
	return true
	end]===]
	
	local ret1 , x1 , y1 = findStr(67 , 170 , 152 , 192 , "团队" , "b52021-303030" , 0.8 , 10 , 10)
	if x1 ~= - 1 and y1 ~= - 1 then
		
		显示('团队任务')
		按下点击(x1 , y1 , - 1 , 120 , - 1 , 1)
		return true
	end
	local ret2 , x2 , y2 = findStr(67 , 170 , 152 , 192 , "外传" , "3adff7-303030" , 0.8 , 10 , 10)
	if x2 ~= - 1 and y2 ~= - 1 then
		
		显示('外传任务')
		按下点击(x2 , y2 , - 1 , 120 , - 1 , 1)
		return true
	end
	return false
	
end

function 一键完成所有可完成的任务()
	setDict(0 , "主线相关.txt")
	useDict(0)
	local ret , x , y = findStr(108 , 634 , 172 , 651 , "一键完成" , "b5a284-303030" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		显示('可跳过')
		按下点击({457 , 631 , 573 , 651}) --完成过去的任务
		return true
	end
	return false
end

function 做外传名望()
	local function 可跳过()
		setDict(0 , "主线相关.txt")
		useDict(0)
		for i = 1 , 5 do
			local ret , x , y = findStr(403 , 256 , 1279 , 672 , "可跳过" , "ffefa4-303030" , 0.8 , 10 , 10)
			if x ~= - 1 and y ~= - 1 then
				显示('可跳过')
				按下点击(x , y , - 86 , 1 , - 1 , 21)
				
				return true
			end
			sleep(70)
		end
		
	end
	
	local 首次等待 = true
	local 运行时间 = os.time()
	local 初始化委托 = false
	local 滑动一次 = false
	while true do
		if not 首次等待 then
			随机延时(800 , 900)
		end
		首次等待 = false
		显示('跳过外传/名望中...')
		if 快速检测游戏状态() then
			运行时间 = os.time()
		end
		if os.time() - 运行时间 > 45 then
			
			return
		end
		if 判断_城镇界面() then
			按下点击({24 , 174 , 32 , 185})--任务
			初始化委托 = false
			滑动一次 = false
		elseif 判断_打开任务界面() then
			随机延时(400 , 500)
			if not 初始化委托 then
				按下点击({10 , 149 , 132 , 191})--委托
				初始化委托 = true
			elseif not 滑动一次 then
				滑动(1210 , 558 , 600 , 512 , 5 , 5 , {10 , 25} , {400 , 500})
				滑动一次 = true
			elseif 可跳过() then
				运行时间 = os.time()
			else
				清屏(true)
				return
			end
			
		elseif 判断_打开任务详细界面() then
			随机延时(600 , 700)
			滑动一次 = false
			if 一键完成所有可完成的任务() then
				运行时间 = os.time()
				
			else
				清屏(true)
			end
		elseif 判断_自动完成() then
			滑动一次 = false
		elseif 清屏_任务跳过() then
			滑动一次 = false
		else
			显示('未找到任何界面')
			清屏(true)
		end
		
	end
	
end
function 跳过全部主线()
	local function 可跳过()
		setDict(0 , "主线相关.txt")
		useDict(0)
		for i = 1 , 5 do
			local ret , x , y = findStr(403 , 256 , 1279 , 672 , "可跳过" , "ffefa4-303030" , 0.8 , 10 , 10)
			if x ~= - 1 and y ~= - 1 then
				显示('可跳过')
				按下点击(x , y , - 86 , 1 , - 1 , 21)
				
				return true
			end
			sleep(70)
		end
		
	end
	初始化城镇界面_背包满了()
	local 首次等待 = true
	local 运行时间 = os.time()
	local 初始化委托 = false
	local 滑动一次 = false
	local 成功跳过 = false
	while true do
		if not 首次等待 then
			随机延时(800 , 900)
		end
		首次等待 = false
		显示('跳过外传/名望中...')
		if 快速检测游戏状态() then
			运行时间 = os.time()
		end
		if os.time() - 运行时间 > 45 then
			
			return
		end
		if 判断_城镇界面() then
			按下点击({24 , 174 , 32 , 185})--任务
			初始化委托 = false
			滑动一次 = false
		elseif 判断_打开任务界面() then
			随机延时(400 , 500)
			if not 初始化委托 then
				按下点击({14 , 80 , 79 , 110})--主线
				初始化委托 = true
			elseif not 滑动一次 then
				滑动(1210 , 558 , 600 , 512 , 5 , 5 , {10 , 25} , {400 , 500})
				滑动一次 = true
			elseif 可跳过() then
				运行时间 = os.time()
				成功跳过 = true
			else
				初始化城镇界面()
				return
			end
			
		elseif 判断_打开任务详细界面() then
			随机延时(600 , 700)
			滑动一次 = false
			if 一键完成所有可完成的任务() then
				运行时间 = os.time()
				
			else
				清屏(true)
			end
		elseif 判断_自动完成() then
			滑动一次 = false
		elseif 清屏_任务跳过() then
			滑动一次 = false
		else
			显示('未找到任何界面')
			清屏(true)
		end
		
	end
	
end
function 判断_返回城镇主线()
	
	for i = 1 , 5 do
		setDict(0 , "字库0.txt")
		useDict(0)
		if not 判断_返回城镇1() then
			
			return true
		end
		local ret , x , y = findStr(1031 , 79 , 1061 , 93 , "主线" , "d6c63a-202020|e6ce42-202020|ad9e31-202020" , 0.85 , 10 , 10)
		if x ~= - 1 and y ~= - 1 then
			显示('点击主线')
			按下点击(x , y , - 1 , 176 , - 1 , 25)
			随机延时(400 , 500)
			return true
		end
		
		local ret2 , x2 , y2 = findStr(1030 , 79 , 1061 , 93 , "主线" , "efd242-202020|c5b631-202020|a49629-202020" , 0.85 , 10 , 10)
		
		if x2 ~= - 1 and y2 ~= - 1 then
			显示('点击主线2')
			按下点击(x2 , y2 , - 1 , 176 , - 1 , 25)
			随机延时(400 , 500)
			return true
		end
		local ret4 , x4 , y4 = findStr(1024 , 71 , 1067 , 87 , "异闻录" , "de924a-303030|d69e52-303030" , 0.8 , 10 , 10)
		if x4 ~= - 1 and y4 ~= - 1 then
			print('异闻录')
			按下点击(x4 , y4 , - 1 , 176 , - 1 , 25)
			随机延时(400 , 500)
			return true
		end
		
		setDict(0 , "字库2.txt")
		useDict(0)
		local ret3 , x3 , y3 = findStr(1030 , 72 , 1062 , 88 , "主线" , "efd339-202020|bdae31-202020" , 0.8 , 10 , 10)
		if x3 ~= - 1 and y3 ~= - 1 then
			显示('点击主线3')
			按下点击(x3 , y3 , - 1 , 176 , - 1 , 25)
			随机延时(400 , 500)
			return true
		end
		
		local ret5 , x5 , y5 = findStr(1030 , 78 , 1062 , 94 , "主线" , "dec63a-303030|ad9a31-303030" , 0.8 , 10 , 10)
		if x5 ~= - 1 and y5 ~= - 1 then
			显示('点击主线5')
			按下点击(x5 , y5 , - 1 , 176 , - 1 , 25)
			随机延时(400 , 500)
			return true
		end
		setDict(0 , "主线相关.txt")
		useDict(0)
		local ret6 , x6 , y6 = findStr(1024 , 80 , 1066 , 103 , "觉醒" , "bd5dd6-202020|ad45c5-202020|843194-202020" , 0.8 , 10 , 10)
		if x6 ~= - 1 and y6 ~= - 1 then
			显示('点击觉醒6')
			按下点击(x6 , y6 , - 1 , 176 , - 1 , 25)
			随机延时(400 , 500)
			return true
		end
		
		sleep(100)
	end
	显示('主线做完了')
	
	return false
	
end
function 判断_转职()
	
	setDict(0 , "字库3.txt")
	useDict(0)
	local ret , x , y = findStr(1113 , 641 , 1264 , 699 , "转职" , "f7e3ad-202020|dec273-202020" , 0.8 , 10 , 10)
	
	if x ~= - 1 and y ~= - 1 then
		显示('转职')
		
		按下点击({355 , 215 , 433 , 503}) --1号位
		随机延时(700 , 800)
		功能_自动转职()
		
		随机延时(400 , 500)
		按下点击({1121 , 648 , 1261 , 693})--转职
		return true
	end
	return false
end
function 判断_完成过去任务()
	
	setDict(0 , "字库0.txt")
	useDict(0)
	
	local ret3 , x3 , y3 = findStr(1003 , 31 , 1082 , 57 , "完成过去" , "fff7bd-202020" , 0.80 , 10 , 10)
	if x3 ~= - 1 and y3 ~= - 1 then
		
		显示('完成过去的任务3')
		按下点击({1005 , 28 , 1137 , 61} , {50 , 60})
		return true
	end
	local ret1 , x1 , y1 = findStr(1007 , 33 , 1081 , 54 , "完成过去" , "ffa200-303030" , 0.8 , 10 , 10)
	if x1 ~= - 1 and y1 ~= - 1 then
		
		显示('完成过去的任务1')
		按下点击({1005 , 28 , 1137 , 61} , {50 , 60})
		return true
	end
	local ret2 , x2 , y2 = findStr(1007 , 33 , 1081 , 54 , "完成过去" , "ef6d52-303030" , 0.8 , 10 , 10)
	if x2 ~= - 1 and y2 ~= - 1 then
		显示('完成过去的任务-勇士')
		按下点击({1005 , 28 , 1137 , 61} , {50 , 60})
		return true
	end
	local ret4 , x4 , y4 = findStr(1005 , 24 , 1138 , 63 , "完成过去" , "3adff7-303030" , 0.8 , 10 , 10)
	if x4 ~= - 1 and y4 ~= - 1 then
		显示('完成过去的任务4')
		按下点击({1005 , 28 , 1137 , 61} , {50 , 60})
		return true
	end
	
	local ret5 , x5 , y5 = findStr(1002 , 31 , 1136 , 57 , "完成过去" , "b52421-303030" , 0.8 , 10 , 10)
	if x5 ~= - 1 and y5 ~= - 1 then
		显示('团队:完成过去的任务')
		按下点击({1005 , 28 , 1137 , 61} , {50 , 60})
		return true
	end
	
	return false
	
end

function 判断_可跳过任务_任务界面()
	setDict(0 , "主线相关.txt")
	useDict(0)
	local ret , x , y = findStr(175 , 260 , 1253 , 671 , "可跳过" , "ffefa4-303030" , 0.8 , 10 , 10)
	if x ~= - 1 then
		print('任务可跳过')
		显示('任务可跳过')
		按下点击(x , y , - 80 , 10 , - 1 , 19)
		return true
	end
	
	local ret1 , x1 , y1 = findStr(175 , 260 , 1253 , 671 , "进行中" , "ffefa4-303030" , 0.8 , 10 , 10)
	if x1 ~= - 1 then
		print('任务进行中')
		显示('任务进行中')
		按下点击(x1 , y1 , - 80 , 10 , - 1 , 19)
		return true
	end
	
	return false
	
end

function 判断_自动完成()
	
	setDict(0 , "主线相关.txt")
	useDict(0)
	
	local ret , x , y = findStr(343 , 327 , 924 , 717 , "自动完成" , "fff3de-303030" , 0.8 , 10 , 10)
	
	if x ~= - 1 and x2 ~= - 1 then
		print('自动完成')
		显示('自动完成')
		按下点击(x , y , - 13 , 108 , - 17 , 27)
		return true
	end
	return false
end

function 判断_学习技能()
	setDict(0 , "字库0.txt")
	useDict(0)
	local ret , x , y = findStr(1157 , 603 , 1192 , 621 , "学习" , "ffffff-202020" , 0.85 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		显示('学习技能')
		按下点击(x , y , - 39 , 70 , - 8 , 26)
		return true
	end
	return false
end
function 判断_技能加点界面()
	setDict(0 , "字库0.txt")
	useDict(0)
	
	local ret , x , y = findStr(55 , 14 , 100 , 38 , "技能" , "fff3bd-202020" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		显示('技能加点界面')
		
		return true
	end
	return false
	
end
function 主线_新手指引()
	
	setDict(0 , "字库3.txt")
	useDict(0)
	local ret , x , y = findStr(0 , 0 , 0 , 0 , "新手" , "fff3ce-303030" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		显示('新手指引')
		按下点击(x , y)
		return true
	end
	
	local ret1 , x1 , y1 = findStr(937 , 646 , 1027 , 670 , "选择冒险" , "000000-303030" , 0.8 , 10 , 10)
	if x1 ~= - 1 and y1 ~= - 1 then
		显示('新手指引选择冒险')
		
		按下点击({1108 , 638 , 1143 , 671}) --冒险
		return true
	end
	local ret2 , x2 , y2 = findStr(186 , 659 , 296 , 688 , "选择装备库" , "000000-303030" , 0.8 , 10 , 10)
	if x2 ~= - 1 and y2 ~= - 1 then
		显示('新手指引选择装备库')
		
		按下点击({68 , 668 , 116 , 687})
		return true
	end
	setDict(0 , "主线相关.txt")
	useDict(0)
	local ret3 , x3 , y3 = findStr(0 , 0 , 0 , 0 , "新手指引" , "fff7d6-303030" , 0.9 , 10 , 10)
	if x3 ~= - 1 then
		显示('新手指引3')
		按下点击(x3 , y3)
		return true
	end
	
	return false
end
function 主线_图内点击()
	
	local x , y = findMultiColor(1074 , 13 , 1106 , 44 , "7b714a-202020" , "11|-8|9c9e8c-202020|-5|-18|312419-202020|-10|-7|635131-202020|-9|4|847152-202020|1|8|9c9e94-202020|14|1|423519-202020|5|-14|736142-202020|11|-16|312421-202020|-14|-13|211c19-202020|-7|12|292419-202020" , 0 , 0.89)
	local x1 , y1 = findMultiColor(928 , 8 , 1075 , 141 , "f7c25a-202020" , "6|-3|efc663-202020|-9|7|efbe52-202020|9|-1|fff3ce-202020|1|2|f7efc5-202020|-1|4|f7efbd-202020|-10|24|ffba21-202020|-14|23|ffefc5-202020|-17|23|ffd273-202020|-17|32|f7e7b5-202020|-15|32|deae3a-202020|-11|35|efd79c-202020|-8|35|c59219-202020|2|30|efbe52-202020|6|23|efca6b-202020|15|21|f7e3a4-202020|26|19|efc66b-202020|-11|34|efd79c-202020|-15|45|efe3bd-202020|-11|49|e6ce94-202020|-1|-39|a47110-202020|-11|-40|ad8608-202020|23|-5|ffce63-202020|34|8|e6ba52-202020" , 0 , 0.89)
	
	if x ~= - 1 and x1 ~= - 1 then
		按下点击({956 , 12 , 993 , 47})
		return true
	end
	local x2 , y2 = findMultiColor(938 , 5 , 995 , 57 , "734d10-202020" , "-7|-8|ffefb5-202020|-19|-2|292819-202020|-2|15|292819-202020|21|-9|5a4529-202020|18|2|ffebbd-202020|7|-20|948163-202020|12|11|ffefbd-202020|7|-13|735131-202020|17|-28|192019-202020|-11|14|192021-202020|12|-6|ffefbd-202020|10|19|192021-202020|-2|-25|9c8a63-202020|13|-16|4a3519-202020|22|-16|4a3d21-202020|20|-24|e6e3c5-202020|23|-24|ffffd6-202020|11|-1|ffefbd-202020|8|3|634510-202020" , 0 , 0.89)
	if x2 ~= - 1 and y2 ~= - 1 then
		显示("关闭放大镜")
		按下点击({955 , 21 , 977 , 43})
		return true
	end
	
	return false
end
function 主线_技能配置取消()
	--提示
	local x , y = findMultiColor(614 , 243 , 668 , 271 , "fff3bd-202020" , "28|1|ffefb5-202020|34|-3|fff3b5-202020|34|-4|fff3bd-202020|-2|-11|fff3b5-202020|-13|-8|ffefb5-202020|-13|0|ffefb5-202020|-12|9|ffefb5-202020|1|7|fff3bd-202020|-4|7|ffefb5-202020|-1|9|fff3bd-202020|2|2|fff3bd-202020|9|-1|fff3bd-202020|-7|-6|b5aa84-202020|-8|-8|fff3bd-202020|11|-9|423529-202020|11|1|3a3129-202020|20|4|3a3129-202020" , 0 , 0.9)
	--技能
	local x1 , y1 = findMultiColor(631 , 350 , 671 , 375 , "ffffff-202020" , "17|1|adaaa4-202020|17|1|adaaa4-202020|23|-4|ffffff-202020|17|-8|ffffff-202020|13|-3|ffffff-202020|-3|-8|efefef-202020|-3|-3|ffffff-202020|1|8|ffffff-202020|1|4|b5b2ad-202020|-4|3|c5bebd-202020|-14|2|ffffff-202020|-12|4|ffffff-202020|-11|9|e6ebe6-202020|-10|2|ffffff-202020" , 0 , 0.9)
	
	if x ~= - 1 and y ~= - 1 and x1 ~= - 1 and y1 ~= - 1 then
		按下点击({472 , 422 , 621 , 477})
		return true
	end
	return false
end
function 判断_升级自动生效()
	
	local x , y = findMultiColor(857 , 636 , 876 , 658 , "e6db9c-202020" , "-3|-2|e6d294-202020|-4|-2|f7efb5-202020|-5|-3|d6c284-202020|-7|-4|d6c284-202020|-4|2|e6d79c-202020|0|8|bda263-202020|2|10|ceb27b-202020|9|2|bd9e63-202020|12|-3|dec684-202020" , 0 , 0.9)
	if x ~= - 1 and y ~= - 1 then
		return true
	end
	return false
end
function 判断_自动加点地下城()
	local x , y = findMultiColor(516 , 40 , 752 , 68 , "948a6b-202020" , "39|5|8c866b-202020|-96|-3|efe3ad-202020|26|-10|efe3ad-202020|29|9|847d63-202020|106|9|c5ba94-202020|112|-4|b5aa84-202020|-56|9|bdb68c-202020|73|5|ada27b-202020|-63|4|948a6b-202020|19|6|f7efb5-202020|33|-15|fff3bd-202020|-15|-6|9c926b-202020|77|-7|6b6552-202020|-26|-15|fff3b5-202020|-55|-2|d6ce9c-202020|-72|9|e6dfa4-202020|-20|8|ada27b-202020|5|-15|fff3bd-202020|65|1|b5aa84-202020" , 0 , 0.9)
	local x1 , y1 = findMultiColor(1097 , 628 , 1154 , 666 , "ce9e4a-202020" , "-4|5|d6b26b-202020|1|-11|ffffff-202020|-23|1|debe84-202020|-11|1|f7ebd6-202020|16|1|efdfbd-202020|18|7|deb673-202020|8|-5|f7f7ef-202020|-21|-10|ffffff-202020|16|-5|f7f3ef-202020|8|1|efe3ce-202020|17|-11|ffffff-202020|10|7|efdfc5-202020|-17|3|deba7b-202020|-12|7|debe7b-202020|-17|-4|cea25a-202020|-23|7|e6d7b5-202020|-13|-11|ffffff-202020|-7|-5|deca9c-202020|9|-11|ffffff-202020" , 0 , 0.9)
	if x ~= - 1 and x1 ~= - 1 then
		显示('自动加点界面地下城')
		return true
	end
	
	local x2 , y2 = findMultiColor(516 , 35 , 757 , 74 , "fff1b9-202020" , "-14|-1|beb38a-202020|65|-18|c2b78d-202020|36|-17|fff1b9-202020|95|-3|fff1b9-202020|46|-18|fff1b9-202020|36|-4|fff1b9-202020|43|-2|fff1b9-202020|53|1|fff1b9-202020|52|-15|bbb188-202020|-43|1|fff1b9-202020|-75|0|f5e8b2-202020|-92|-21|fff1b9-202020|-90|-18|fff1b9-202020|124|-18|fff1b9-202020" , 0 , 0.9)
	if x2 ~= - 1 and y2 ~= - 1 then
		显示('自动加点界面排位赛')
		return true
	end
	
	return false
	
end
function 判断_推荐配置_主线()
	for i = 1 , 5 do
		local x , y = findMultiColor(816 , 631 , 903 , 661 , "c58a21-202020" , "41|8|f7ebc5-202020|12|10|ce9a31-202020|-16|-8|fffbe6-202020|-21|-2|c59a42-202020|-6|-8|fffbe6-202020|28|3|cea652-202020|-40|1|bd8a21-202020|22|5|efdbad-202020|-15|10|deb66b-202020|-8|1|cea652-202020|-38|10|d6a242-202020|25|-5|e6ca94-202020|-28|-2|cea652-202020|-36|-8|fffbe6-202020|17|-7|f7efce-202020|8|-1|d6ae63-202020|41|-5|f7efce-202020|4|10|d6a242-202020|8|5|e6ca94-202020" , 0 , 0.9)
		if x ~= - 1 then
			sleep(500)
			按下点击(x , y , - 10 , 10 , - 5 , 5) --推荐配置
			return true
		end
		
		sleep(100)
	end
	
	return false
end
function 判断_自动配置_主线()
	for i = 1 , 5 do
		local x , y = findMultiColor(927 , 626 , 1011 , 665 , "9c8152-202020" , "14|8|9c8152-202020|35|-4|947d4a-202020|-32|10|9c8152-202020|8|10|9c8152-202020|-20|2|fff7de-202020|-19|-11|fffbe6-202020|15|-8|fff7de-202020|-7|-20|846d42-202020|25|-1|fffbe6-202020|11|1|fffbe6-202020|-26|-16|d6caad-202020|-12|-5|fff7de-202020|45|-16|b5a67b-202020" , 0 , 0.9)
		if x ~= - 1 and y ~= - 1 then
			按下点击(x , y , - 10 , 10 , - 5 , 5)
			随机延时(1500 , 2000)
			按下点击({930 , 630 , 996 , 666})
			return true
		end
		
		sleep(100)
		
	end
	
	return false
end
function 功能_技能加点配置()
	
	local 初始化 = false
	local 自动加点 = false
	local 技能配置 = false
	local 运行时间 = os.time()
	while true do
		随机延时(800 , 900)
		if 快速检测游戏状态() then
			运行时间 = os.time()
		end
		if os.time() - 运行时间 > 20 then
			
			初始化城镇界面()
			return
		end
		
		if 技能配置 then
			
			初始化城镇界面()
			return
		end
		显示('自动加点运行中...........')
		if 判断_技能加点界面() then
			显示('技能加点')
			
			if not 初始化 then
				按下点击(491 , 137)---初始化
				print('已初始化技能')
				初始化 = true
			elseif not 自动加点 then
				
				按下点击({554 , 134 , 652 , 146})--自动加点
				
			else
				初始化城镇界面()
				return
			end
			
		elseif 判断_自动加点地下城() then
			显示('自动加点')
			if not 自动加点 then
				随机延时(1200 , 1500)
				if not 判断_升级自动生效() then
					按下点击({857 , 636 , 879 , 657} , {50 , 400})--自动生效
					随机延时(400 , 600)
					
				end
				按下点击({1064 , 621 , 1185 , 673} , {50 , 400})--应用
				print('已自动加点')
				自动加点 = true
			else
				清屏(true)
			end
			
		elseif 判断_技能配置() then
			
			显示('技能配置')
			if not 技能配置 then
				if not 判断_推荐配置_主线() then
					
					按下点击({930 , 630 , 996 , 666}) --自动配置
					
				end
				
				技能配置 = true
				print('已自动配置技能')
			end
			
			显示('自动配置完成,返回城镇界面')
			while true do
				显示('学习技能结束中...')
				if 快速检测游戏状态() then
					return
				end
				随机延时(700 , 800)
				if 判断_城镇界面() or 判断_返回城镇1() or 判断_副本中() or 判断_可开燃烧交易界面() then
					return
				else
					清屏(true)
				end
				
			end
			
		elseif 判断_城镇界面() then
			
			break
			
		else
			清屏(true)
			
		end
	end
	
end

