local 开始游戏 = {588 , 551 , 693 , 576 , "ff6dbd-202020" , "0|2|290029-202020|5|-8|ff5dbd-202020|-23|-7|ff5dbd-202020|-34|13|ff8ece-202020|-10|13|ff8ece-202020|24|-8|ff59b5-202020|16|-8|ff59b5-202020|16|13|ff8ec5-202020|29|6|ff7dc5-202020|29|13|ff8ac5-202020|39|-3|290031-202020|41|0|ff71c5-202020|50|11|ff86c5-202020|56|-4|290831-202020|60|-5|ff61bd-202020|61|8|ff81c5-202020" , 0 , 0.8}
local 城镇_设置 = {1236 , 120 , 1275 , 145 , "ffefa4-202020" , "-2|0|efdf9c-202020|-4|0|190c10-202020|3|-7|deca94-202020|10|0|ffefa4-202020|0|11|ffeba4-202020|-6|6|ffeba4-202020|-10|0|ffefa4-202020|0|-13|6b6142-202020|13|0|847952-202020|7|9|ffefa4-202020|0|12|ffefa4-202020|-5|9|d6c28c-202020" , 0 , 0.8}
local 城镇_商城 = {980 , 25 , 1019 , 67 , "bd3d3a-202020" , "1|0|ce4542-202020|0|2|b57573-202020|1|2|f79e9c-202020|1|3|de7173-202020|0|4|c55152-202020|-2|0|d6b29c-202020|-2|-3|100c08-202020|-1|-4|211c19-202020|3|-4|080c08-202020|-3|-7|7b2010-202020|-7|-8|deb684-202020|-11|-8|deaa7b-202020|-10|-9|fff7ce-202020|2|-9|ffefd6-202020|3|-9|fff3de-202020|6|-9|f7f3d6-202020|3|-10|f7efce-202020|3|-11|fff3c5-202020|3|-13|ffefb5-202020|9|-10|de5531-202020|12|-8|bd5531-202020|13|-8|ad4929-202020|12|-6|8c2429-202020|10|-3|211810-202020|8|2|fff7bd-202020|8|5|f7ca4a-202020|5|5|ff5d19-202020|5|6|631408-202020|-1|11|ff6942-202020|2|13|ad4129-202020|2|14|7b1010-202020|-3|14|7b0c10-202020|-5|14|7b1010-202020|-9|14|7b1010-202020|-10|10|deca73-202020|-10|9|d6b663-202020|-11|7|dedfce-202020|-12|5|e6ae63-202020|-14|5|d68631-202020" , 0 , 0.8}
local 城镇_委托 = {1191 , 436 , 1263 , 516 , "ffffd6-202020" , "1|3|100c10-202020|4|3|212019-202020|12|0|fff7de-202020|10|11|7b2821-202020|6|-1|efefde-202020|6|-14|e6c67b-202020|4|-10|8c4121-202020|-8|-2|ffebd6-202020|-16|2|632810-202020|-14|14|e6cec5-202020" , 0 , 0.8}
local 祥瑞溪谷_灰色入场 = {1087 , 627 , 1269 , 693 , "737573-202020" , "2|0|080408-202020|3|5|737973-202020|-4|18|000000-202020|-4|19|3a353a-202020|6|8|6b6d6b-202020|6|7|211c21-202020|16|18|080c08-202020|22|-1|211c21-202020|19|5|000000-202020|19|7|7b797b-202020|19|17|313531-202020" , 0 , 0.8}
local 前往可入场 = {1057 , 625 , 1268 , 701 , "ffdfc5-202020" , "-43|13|ffdfc5-202020|-40|13|ffdfc5-202020|-40|8|ffdfc5-202020|-40|1|ffdfc5-202020|-22|14|ffdfc5-202020|14|13|ffdfc5-202020|59|-2|ffdfc5-202020|57|-2|ffdfc5-202020|27|-5|dea67b-202020|30|-5|ce9a6b-202020|-19|12|ffdfc5-202020|-9|12|ffdfc5-202020|-36|-4|ffdfc5-202020|-42|-7|deb284-202020" , 0 , 0.8}
local 城镇_打造 = {1000 , 620 , 1075 , 703 , "ffd74a-202020" , "16|-1|f7ca31-202020|23|6|bd5d31-202020|12|11|deaa5a-202020|5|14|e6be6b-202020|-2|21|fff7ad-202020|24|20|f7fbef-202020|17|25|946563-202020|5|39|ffffde-202020|-4|38|efefef-202020|-1|39|000000-202020|12|38|efebef-202020|22|38|d6d2d6-202020|15|43|949a94-202020|11|35|ad7152-202020" , 0 , 0.8}
local 城镇_背包 = {1080 , 597 , 1279 , 714 , "dec6bd-303030" , "-9|7|e6aa5a-303030|-2|3|efba63-303030|1|13|cebab5-303030|18|1|ada27b-303030|10|-2|e6e7e6-303030|-20|-1|e6ba29-303030|-14|0|e6ba6b-303030|-16|2|f7be3a-303030|13|-5|cecac5-303030|1|-5|ffca9c-303030|11|-7|a4aead-303030|-13|-3|e6ce6b-303030|-12|-9|e6a631-303030|-2|-9|d6b24a-303030" , 0 , 0.9}
local 返回标签 = {16 , 22 , 37 , 32 , "fff3bd-202020" , "3|-3|fff3bd-202020|0|-3|735519-202020|2|-6|7b5d29-202020|2|-10|efdfb5-202020|3|-14|6b5d31-202020|-10|-4|4a3919-202020|-9|-3|efdbad-202020|-16|0|312810-202020|-14|0|b59e6b-202020|-15|1|ceba84-202020|-16|1|524121-202020|-18|1|101010-202020|3|5|ffebb5-202020|9|1|ffebb5-202020|12|1|e6d29c-202020|13|1|dece8c-202020|14|1|bdb27b-202020|16|1|4a4531-202020|17|1|292019-202020|15|0|292010-202020|15|2|292010-202020|14|2|423521-202020|13|2|635531-202020|13|0|292010-202020|11|0|635529-202020|8|0|d6ba7b-202020|6|5|524119-202020|5|7|423119-202020|4|8|4a3519-202020|7|8|191810-202020" , 0 , 0.8}
local 速通按钮 = {1041 , 119 , 1213 , 181 , "a46900-202020" , "3|6|fff7de-202020|3|5|bd8a31-202020|4|5|ad6d00-202020|1|1|f7efd6-202020|2|3|ad7510-202020|3|3|fff3de-202020|5|2|fff7e6-202020|10|0|fff3de-202020|10|4|fff3de-202020|9|6|b57910-202020|5|12|fff7de-202020|4|13|fff7de-202020|1|14|fff7e6-202020|0|14|e6ca94-202020|6|15|dec28c-202020|15|15|fff3de-202020|14|12|e6ce9c-202020|15|12|fff7e6-202020|15|11|fff3de-202020|14|8|fff3de-202020|15|2|fff7de-202020|18|1|f7e7c5-202020|19|1|fff3de-202020|19|2|fff7de-202020|20|2|fff3de-202020|21|3|d6b67b-202020|18|6|fff3de-202020|18|13|fff3de-202020|18|14|fff3de-202020|17|14|e6ce9c-202020|22|1|fff3de-202020|29|2|fff7e6-202020|28|2|ad7108-202020|24|6|ad6d00-202020|23|12|fff7e6-202020|24|12|ad7100-202020|32|14|fff3de-202020|31|13|b57910-202020|30|13|c59e4a-202020|32|15|fff3de-202020" , 0 , 0.8}
local 区域移动 = {953 , 307 , 1223 , 658 , "f7e3b5-202020" , "1|2|946d31-202020|-2|4|9c7531-202020|0|0|f7e3b5-202020|-1|1|d6be84-202020|3|-1|f7e3bd-202020|11|-1|ffe7bd-202020|11|2|e6ca9c-202020|13|4|9c7931-202020|4|7|947131-202020|-6|0|ffe7b5-202020|-6|-3|f7e3b5-202020|0|-8|fff3bd-202020|6|-6|ffebbd-202020|13|-1|ffe7bd-202020|12|-7|f7dfb5-202020|-6|-8|ffe3bd-202020|1|-15|ffe7bd-202020|-12|2|9c7531-202020|-13|4|debe8c-202020|-1|10|bda273-202020|28|1|e6d7a4-202020|27|1|f7e7bd-202020|20|-1|ffe7b5-202020|15|-1|ffe7bd-202020|7|14|ffebc5-202020|3|25|f7dfb5-202020|7|27|ffebc5-202020|-13|12|ffe7c5-202020|-6|28|ffebc5-202020|1|26|ffebc5-202020|-4|26|ffebc5-202020|-15|27|ffebc5-202020|-14|23|ffe7c5-202020|11|15|d6ba94-202020|14|12|f7e3bd-202020|19|14|ffebc5-202020|14|22|ffebc5-202020|10|24|efd2a4-202020|14|25|ffebc5-202020|13|27|debe94-202020|20|22|ffebc5-202020" , 0 , 0.8}
local 圣者封印 = {1 , 204 , 111 , 501 , "a49273-202020" , "2|5|ad9273-202020|5|0|a49273-202020|10|-3|ad9273-202020|20|-9|ad9273-202020|21|4|a49273-202020|20|-2|a48e73-202020|20|-5|ad9273-202020|-38|-3|ad9273-202020|14|5|ad9273-202020|15|-10|ad9273-202020|-14|-2|a48e73-202020|-17|-1|a48e73-202020|-19|0|a49273-202020|-6|4|a48e73-202020" , 0 , 0.9}
local 委托入场 = {1051 , 599 , 1279 , 719 , "fff3de-202020" , "0|-3|fff7de-202020|8|4|fff3de-202020|10|8|fff3de-202020|12|13|ce9e3a-202020|10|-1|efd7ad-202020|3|-2|fff7de-202020|11|9|fff3de-202020|12|6|fff3de-202020|7|3|e6c28c-202020|4|6|e6ca94-202020|-25|10|deae63-202020|-16|1|fff7de-202020|-14|1|fff3de-202020|-13|-1|deb673-202020" , 0 , 0.9}
local 完成确认 = {523 , 399 , 752 , 510 , "ffffff-101010" , "10|7|ffffff-101010|15|4|ffffff-101010|11|-2|ffffff-101010|18|6|ffffff-101010|10|-9|efdfbd-101010|9|-8|d6be8c-101010|-7|-4|ffffff-101010|-8|-1|ffffff-101010|-8|10|d6a652-101010|-4|6|efdfbd-101010|3|-4|efebde-101010|-1|-7|ffffff-101010|3|9|efdbb5-101010|-5|3|ffffff-101010|-12|1|ffffff-101010|-10|0|efe3ce-101010|-1|0|ffffff-101010|-3|1|ffffff-101010|1|-5|ffffff-101010" , 0 , 0.9}

function 判断_冒险入口()
	
	local x , y = findMultiColor(1105 , 631 , 1154 , 676 , "ff9200-202020" , "0|14|ffd794-202020|-2|15|ffd294-202020|-17|6|bda25a-202020|-21|9|ce9e63-202020|18|-5|f7f3f7-202020|-20|-26|ffce8c-202020|-22|-21|ce9a5a-202020|2|-22|efa263-202020|-7|-22|ffffa4-202020|13|-12|efc27b-202020|14|-7|c5b26b-202020|13|-21|efc27b-202020|22|-22|e6aa6b-202020|14|-22|deb273-202020|-1|-13|ffffff-202020|-11|-4|ffd700-202020|-7|3|ff5d00-202020|-17|-14|ef5d00-202020" , 0 , 0.9)
	if x ~= - 1 and y ~= - 1 then
		按下点击(x , y)
		return true
	end
	return false
end

function 入口_冒险奖励()
	
	--按下点击({1026,544,1047,566})
	for i = 1 , 5 do
		local x , y = findMultiColor(892 , 522 , 1266 , 630 , "d6a63a-202020" , "21|8|efd76b-202020|-9|7|ce9e63-202020|4|5|e6d294-202020|-1|3|ceae63-202020|-11|-3|f7ca5a-202020|-9|0|ce9e6b-202020|18|7|e6d273-202020|21|6|f7d273-202020|14|4|f7d76b-202020|3|-4|ce9663-202020|7|-6|ffe39c-202020|-3|-6|d69a63-202020|-6|-9|f7eb6b-202020|-11|-10|e6b67b-202020" , 0 , 0.9)
		if x ~= - 1 and y ~= - 1 then
			print('到冒险奖励入口')
			按下点击(x , y , - 15 , 20 , - 17 , 16)
			return true
		end
		
		sleep(100)
	end
	显示('未找到冒险奖励入口')
	return false
end

function 入口_完成确认()
	local x , y = findMultiColorT(完成确认)
	if x ~= - 1 and y ~= - 1 then
		print('任务完成确认')
		按下点击(x , y , - 60 , 60 , - 25 , 25)
		随机延时(200 , 400)
		return true
		
	end
	return false
end
function 入口_返回确认()
	setDict(0 , "字库0.txt")
	useDict(0)
	local ret , x , y = findStr(710 , 424 , 756 , 446 , "返回确认" , "fff7e6-202020" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 --[===[and not 清屏_角色扩展栏提示_不点击()]===]then
		print('找到并点击了返回确认')
		
		随机延时(600 , 800)
		按下点击({656 , 405 , 814 , 465})
		随机延时(200 , 400)
		return true
	end
	return false
end
function 入口_使用泰拉确认 ()
	setDict(0 , "字库2.txt")
	useDict(0)
	local ret , x , y = findStr(678 , 468 , 811 , 529 , "使用泰拉" , "fff7de-202020|efdbb5-202020" , 0.9 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		print('使用泰拉确认')
		按下点击(x , y , - 47 , 59 , - 10 , 52)
		随机延时(200 , 400)
		return true
	end
	return false
	
end
function 入口_存入确认()
	setDict(0 , "字库2.txt")
	useDict(0)
	local ret , x , y = findStr(616 , 614 , 664 , 638 , "确认" , "ffffff-202020" , 0.9 , 10 , 10)
	
	if x ~= - 1 and y ~= - 1 then
		print('存入确认')
		
		按下点击(x , y , - 69 , 69 , - 19 , 30)
		随机延时(200 , 400)
		return true
	end
	return false
end
function 入口_周常确认()
	--周常确认
	local x , y = findMultiColor(689 , 452 , 745 , 480 , "fff7de-202020" , "11|1|fff7de-202020|16|-4|fff7de-202020|15|-3|d6aa5a-202020|14|1|fff7de-202020|17|-2|deba73-202020|19|1|fff7de-202020|-17|-6|fff7de-202020|-2|2|f7e3c6-202020|0|3|fff7de-202020|-6|1|fff7de-202020|-16|2|fff7de-202020|-8|-5|d6aa5a-202020|-7|-10|e7c38c-202020|-4|-9|d6ae63-202020" , 0 , 0.9)
	--提示
	local x1 , y1 = findMultiColor(609 , 221 , 670 , 249 , "fff3bd-202020" , "25|5|bdae84-202020|8|6|fff3bd-202020|8|7|fff3bd-202020|7|11|efe3ad-202020|11|4|fff3bd-202020|18|12|efdbad-202020|0|-9|ffebb5-202020|-1|-3|fff3bd-202020|-2|-5|fff3bd-202020|-19|-3|fff3bd-202020|-15|3|efdfad-202020|-14|13|fff3bd-202020|-11|11|ffefb5-202020|-17|-6|bdb284-202020|3|-6|4a3c29-202020|3|4|312821-202020" , 0 , 0.9)
	
	if x ~= - 1 and y ~= - 1 and x1 ~= - 1 and y1 ~= - 1 then
		--print('周常确认')
		print("周常确认")
		按下点击(x , y , - 66 , 68 , - 30 , 21)
		随机延时(200 , 400)
		
		return true
	end
	
	return false
end

function 入口_学习技能确认()
	
	local x , y = findMultiColor(609 , 213 , 671 , 246 , "b4a981-202020" , "16|-6|8c8264-202020|-8|-9|7d7257-202020|-13|-14|c6b98e-202020|3|9|7e745a-202020|32|-4|716750-202020|12|5|7a7056-202020|-4|6|f3e6b0-202020|23|-6|8c8264-202020|21|8|b1a67f-202020|-15|-2|ada17c-202020|30|3|9b906e-202020|-3|-13|b5a881-202020|5|-10|776c52-202020|-16|7|9b8f6e-202020" , 0 , 0.9)
	local x1 , y1 = findMultiColor(706 , 464 , 765 , 490 , "c28c2b-202020" , "18|7|c58f2a-202020|3|-6|fff4df-202020|-7|13|f0dab0-202020|-9|7|ddb974-202020|15|-7|dab87a-202020|19|13|c38b1f-202020|11|11|e5c68b-202020|-21|0|dab470-202020|-15|-4|d5ad65-202020|2|11|cd9d41-202020|12|4|e9ce9c-202020|-21|12|f5e2be-202020|-14|2|c08923-202020|-7|-3|c28e30-202020" , 0 , 0.9)
	if x ~= - 1 and y1 ~= - 1 then
		print("学习技能确认")
		按下点击({661 , 453 , 812 , 501})
		return true
	end
	return false
	
end
function 入口_挑战结束确认()
	--挑战结束
	
	local x , y = findMultiColor(571 , 84 , 708 , 114 , "de9e42-202020" , "41|11|dec37b-202020|38|3|deb263-202020|-32|1|efcf7b-202020|52|10|f7db94-202020|58|7|ce9a5a-202020|77|11|debe7b-202020|66|-7|f7b652-202020|62|-6|f7b652-202020|-22|1|ffdf7b-202020|-9|-8|dea642-202020|-57|-2|efba52-202020|-46|5|d69e52-202020|-45|-8|e7a631-202020|-49|-11|ef9a31-202020" , 0 , 0.9)
	local x2 , y2 = findMultiColor(612 , 638 , 665 , 665 , "fffbde-202020" , "11|4|fffbde-202020|18|1|fffbde-202020|29|6|d6aa52-202020|25|-5|d6b263-202020|10|-16|efdbad-202020|-14|-9|fffbde-202020|-17|-14|fffbde-202020|-8|6|fffbde-202020|-2|1|fffbde-202020|4|6|d6a64a-202020|5|-10|f7e7bd-202020|-14|-5|fffbde-202020|-6|-7|fffbde-202020|0|-12|fffbde-202020" , 0 , 0.9)
	if x ~= - 1 and y ~= - 1 and x2 ~= - 1 and y2 ~= - 1 then
		print("入口_挑战结束确认")
		按下点击(x2 , y2 , - 87 , 95 , - 30 , 22)
		
		--随机延时(400 , 500)
		return true
	end
	
	local x1 , y1 = findMultiColor(584 , 48 , 695 , 105 , "ffb2ad-202020" , "-45|18|de8e8c-202020|1|32|efc2ce-202020|-17|15|f7d7ce-202020|33|32|ffebe6-202020|33|30|ffffff-202020|26|4|ffffff-202020|26|-1|ffffff-202020|9|-16|efb2ad-202020|13|27|ffffff-202020|15|-6|f7816b-202020|14|-7|ffffff-202020|37|-11|e69684-202020|55|0|ffffff-202020|47|-17|f7dfde-202020|-34|10|f7bebd-202020|-23|-3|f7d7ce-202020|-18|2|f7dfd6-202020|-7|5|f78173-202020|1|-12|f7cec5-202020" , 0 , 0.9)
	if x1 ~= - 1 and y1 ~= - 1 then --雷龙奖励
		print('-雷龙奖励')
		按下点击({591 , 653 , 713 , 688})
		return true
	end
	setDict(0 , "界面判断.txt")
	useDict(0)
	local ret2 , x2 , y2 = findStr(458 , 573 , 825 , 715 , "继续" , "ffffff-303030" , 0.8 , 10 , 10)
	if x2 ~= - 1 and y2 ~= - 1 then --雷龙奖励
		print('雷龙奖励继续')
		按下点击(x2 , y2)
		return true
	end
	
	return false
end

function 入口_世界领主确认()
	
	local x , y = findMultiColor(492 , 631 , 559 , 670 , "deba73-303030" , "12|-5|e6d29c-303030|18|5|fff7de-303030|16|10|fffbde-303030|25|4|fff7de-303030|12|-9|fff7de-303030|-16|8|d6a242-303030|-2|9|fff7de-303030|-12|6|fffbde-303030|-2|-3|fff7de-303030" , 0 , 0.9)
	local x1 , y1 = findMultiColor(518 , 19 , 679 , 65 , "ffffff-303030" , "-29|16|ffffff-303030|-19|20|ffffff-303030|0|-6|ffffff-303030|0|-3|ffffff-303030|-13|-6|ffffff-303030|50|-4|ffffff-303030|52|10|ffffff-303030|41|1|ffffff-303030|-61|-2|ffffff-303030" , 0 , 0.9)
	
	if x ~= - 1 and y ~= - 1 and x1 ~= - 1 and y1 ~= - 1 then
		print('入口_世界领主确认')
		按下点击({442 , 626 , 618 , 674})
		--随机延时(400 , 500)
		return true
	end
	return false
end

function 入口_存放()
	
	--存放
	local x , y = findMultiColor(610 , 612 , 671 , 642 , "ffffff-303030" , "-2|2|ffffff-303030|13|-13|ffffff-303030|9|-13|e7cb9c-303030|8|-11|debe84-303030|3|2|ffffff-303030|13|-4|e7cfa5-303030|-24|-13|cea24a-303030|-21|-11|ffffff-303030|-18|-13|f7efde-303030" , 0 , 0.9)
	--金库自动存放
	local x1 , y1 = findMultiColor(552 , 61 , 723 , 97 , "fff3bd-303030" , "52|8|fff3bd-303030|71|13|cebe94-303030|84|16|fff3bd-303030|14|6|fff3bd-303030|-1|15|fff3bd-303030|-31|16|fff3bd-303030|-37|6|fff3bd-303030|-57|-4|fff3bd-303030|-62|-6|fff3bd-303030|-21|1|423829-303030|-48|3|423429-303030|61|3|423829-303030|33|1|423829-303030" , 0 , 0.9)
	if x ~= - 1 and x1 ~= - 1 then
		显示('存放')
		按下点击({556 , 602 , 721 , 652})
		--随机延时(400 , 500)
		return true
	end
	return false
end

function 入口_提示确认()
	
	local x , y = findMultiColor(709 , 422 , 763 , 451 , "fff4df-202020" , "-12|-12|fff4df-202020|16|-7|b37300-202020|-6|10|bd7c00-202020|15|3|ba7800-202020|-20|-9|fff4df-202020|8|0|b97a03-202020|9|-9|b27300-202020|20|13|bf7e00-202020|-17|7|bc7b00-202020|21|-15|af7101-202020|2|8|bd7c00-202020|-33|-10|b07300-202020|-32|4|b97800-202020|-27|-6|fff4df-202020|-19|0|fff4df-202020|-12|-4|fff4df-202020" , 0 , 0.9)
	local x1 , y1 = findMultiColor(610 , 254 , 669 , 288 , "3b3226-202020" , "-20|3|382f25-202020|-9|2|baae85-202020|22|1|fff1b9-202020|-13|10|a19673-202020|-12|-9|a29572-202020|28|19|322b21-202020|13|6|fff1b9-202020|14|-12|42372a-202020|2|-9|fff1b9-202020|13|-5|3d3428-202020|-5|-10|b5a981-202020|-2|16|332b22-202020|5|7|cabd91-202020" , 0 , 0.9)
	if x ~= - 1 and x1 ~= - 1--[===[ and not 清屏_角色扩展栏提示_不点击()]===] then
		显示('变动确认')
		按下点击({670 , 412 , 803 , 461})
		
		return true
	end
	return false
end

function 入口_装备获得确认()
	
	local x11 , y11 = findMultiColor(560 , 604 , 726 , 647 , "ffffff-202020" , "-1|18|bb7a00-202020|9|-3|ad7000-202020|-14|18|bb7a00-202020|-10|10|ffffff-202020|25|12|b77800-202020|-20|7|ffffff-202020|16|-4|ad7000-202020|13|13|ffffff-202020|20|4|b07300-202020|-8|2|ffffff-202020|8|4|b07300-202020|-28|8|b47400-202020|10|22|bd7c00-202020" , 0 , 0.89)
	local x12 , y12 = findMultiColor(635 , 136 , 731 , 157 , "7d6549-202020" , "49|2|c59c6c-202020|-32|7|82684b-202020|18|9|b59064-202020|-8|-7|edbc80-202020|-30|0|a08059-202020|17|-8|a2815a-202020|-18|9|b59064-202020|-40|-8|a2815a-202020|39|-2|dbad76-202020|23|-2|c09869-202020|-9|4|ba9366-202020|-36|-3|a4825b-202020|2|8|846a4c-202020|-42|8|cda26f-202020|30|5|e0b179-202020|35|-7|d9ac76-202020|38|7|b58f64-202020|13|-1|927553-202020|44|9|cea471-202020" , 0 , 0.9)
	if x11 ~= - 1 and y12 ~= - 1 then
		显示('装备确认11')
		按下点击(x11 , y11 , - 61 , 69 , - 23 , 23)
		
		return true
	end
	return false
end

function 判断_已存在的名字确认()
	setDict(0 , "确认.txt")
	useDict(0)
	local ret , x , y = findStr(466 , 241 , 769 , 481 , "已存在的" , "ffffff-303030" , 0.8 , 10 , 10)
	local ret2 , x2 , y2 = findStr(345 , 242 , 937 , 687 , "确认" , "fff3de-303030" , 0.8 , 10 , 10)
	if x ~= - 1 and y2 ~= - 1 then
		显示('昵称已存在')
		按下点击(x2 , y2)
		return true
	end
	
	setDict(0 , "确认.txt")
	useDict(0)
	local ret1 , x1 , y1 = findStr(619 , 307 , 702 , 332 , "字数限制" , "ffffff-303030" , 0.8 , 10 , 10)
	if x1 ~= - 1 and y1 ~= - 1 then
		显示('字数限制')
		按下点击({565 , 436 , 716 , 489})
		return true
	end
	
	return false
	
end
function 入口_确认_初始化技能()
	
	local x , y = findMultiColor(587 , 351 , 681 , 374 , "a89073-202020" , "-2|8|a89073-202020|-9|8|a89073-202020|-31|10|a89073-202020|-23|5|a89073-202020|-31|8|a89073-202020|13|8|a89073-202020|16|0|a89073-202020|53|-4|a89073-202020|-34|-5|a89073-202020|41|2|a89073-202020|30|7|a89073-202020|38|1|a89073-202020|34|1|a89073-202020|-12|-2|a89073-202020" , 0 , 0.9)
	local x1 , y1 = findMultiColor(714 , 457 , 761 , 483 , "fff4df-202020" , "4|-10|fff4df-202020|5|0|f6e4c1-202020|14|-5|fff4df-202020|11|2|fff4df-202020|19|-1|fff4df-202020|17|-12|d7b26c-202020|-13|-14|fff4df-202020|-15|2|d6aa57-202020|-9|0|fff4df-202020|-8|-5|fff4df-202020|-7|-6|fff4df-202020|-6|-3|fff4df-202020|-7|-3|fff4df-202020|-8|-4|fff4df-202020" , 0 , 0.9)
	if x ~= - 1 and y1 ~= - 1 then
		显示('确认初始化冒险团技能')
		随机延时(300 , 400)
		按下点击({551 , 351 , 576 , 375})--打勾
		随机延时(300 , 400)
		按下点击({674 , 453 , 816 , 491})--确认
		return true
	end
	return false
end
function 判断_立即使用确认()
	
	local x , y = findMultiColor(517 , 534 , 612 , 562 , "efdfce-202020" , "-40|15|ffffff-202020|-37|14|dec2a4-202020|-43|11|deae8c-202020|16|15|deba94-202020|19|12|ffffff-202020|25|17|ffffff-202020|32|11|ffffff-202020|34|-1|ffffff-202020|24|10|ffffff-202020|32|0|ffffff-202020|-12|1|cea27b-202020|-11|12|ffffff-202020|-21|14|ffffff-202020|-22|11|ffffff-202020|-26|2|ffffff-202020|13|9|ce966b-202020|6|-1|ffffff-202020|7|6|ffffff-202020|-42|2|ffffff-202020" , 0 , 0.9)
	local x1 , y1 = findMultiColor(661 , 528 , 783 , 567 , "ffffff-202020" , "9|-3|ffffff-202020|10|7|ffffff-202020|14|2|ffffff-202020|17|4|ffffff-202020|19|2|ffffff-202020|-5|-9|efe7d6-202020|-6|-4|ffffff-202020|-8|-10|decaa4-202020|-14|-9|ffffff-202020|-13|-5|cea65a-202020|-8|6|deca9c-202020|-5|6|fff7ef-202020|-2|-10|f7f3e6-202020|3|4|efdfc5-202020|0|2|ffffff-202020|2|-1|ffffff-202020|-1|-4|ffffff-202020|-4|-7|cea252-202020|-1|-6|f7f3e6-202020|6|-10|ad7100-202020|5|1|ffffff-202020|8|1|bd7900-202020|16|-4|b57500-202020|19|6|bd7900-202020" , 0 , 0.9)
	if x ~= - 1 and y1 ~= - 1 then
		print('判断_立即使用确认')
		按下点击({660 , 527 , 774 , 566})
		return true
	end
	
	return false
end
function 入口_是_跳过新手指引()
	setDict(0 , "字库3.txt")
	useDict(0)
	for i = 1 , 5 do
		
		local ret , x , y = findStr(720 , 423 , 747 , 448 , "是" , "fff7e5-303030" , 0.8 , 10 , 10)
		if x ~= - 1 and y ~= - 1 then
			print('新手指引是')
			按下点击({675 , 410 , 803 , 458})
			return true
			
		end
		
		sleep(100)
	end
	
	return false
end
function 入口_退出()
	setDict(0 , "确认.txt")
	useDict(0)
	local ret , x , y = findStr(265 , 447 , 1081 , 719 , "退出" , "ffffff-303030" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then--排位赛
		显示('胜利退出')
		按下点击(x , y , - 5 , 81 , - 16 , 30)
		return true
		
	end
	
	local ret1 , x1 , y1 = findStr(355 , 544 , 955 , 716 , "下一页" , "ffffff-303030" , 0.8 , 10 , 10)
	if x1 ~= - 1 and y1 ~= - 1 then--排位赛
		显示('胜利下一页')
		按下点击(x1 , y1 , - 5 , 81 , - 16 , 30)
		return true
		
	end
	
	return false
end
function 入口_同意_同意腾旭协议()
	setDict(0 , "确认.txt")
	useDict(0)
	local ret , x , y = findStr(743 , 539 , 796 , 565 , "同意" , "ffffff-202020" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then --同意腾旭协议
		显示('同意腾旭协议')
		按下点击(x , y , - 5 , 81 , - 16 , 30)
		return true
		
	end
	return false
end
function 入口_获得了一种道具_确认()
	setDict(0 , "确认.txt")
	useDict(0)
	local ret , x , y = findStr(565 , 212 , 716 , 245 , "获得了一种道具" , "dedfde-202020" , 0.8 , 10 , 10)
	local x , y = findMultiColor(588 , 433 , 696 , 477 , "efebde-303030" , "17|-5|ffffff-303030|7|-4|ffffff-303030|21|8|d6b26b-303030|-1|15|debe84-303030|-6|4|c5923a-303030|16|3|f7f3e6-303030|-16|-4|dec69c-303030|24|14|f7efde-303030|11|7|bd8a21-303030|-8|12|f7f7ef-303030|14|13|c58e29-303030|-14|2|cea252-303030|8|13|ce9a42-303030|-15|14|efdbbd-303030" , 0 , 0.9)
	
	if x ~= - 1 and x1 ~= - 1 then
		显示('获得确认')
		--返回(4)
		按下点击(x , y)
		return true
		
	end
	
	return false
	
end

function 入口_关闭技能显示()
	setDict(0 , "确认.txt")
	useDict(0)
	local ret , x , y = findStr(666 , 305 , 770 , 333 , "关技能显示" , "ffffff-303030" , 0.8 , 10 , 10)
	if x ~= - 1 and x1 ~= - 1 then --同意腾旭协议
		显示('技能显示取消')
		
		按下点击({477 , 464 , 618 , 516})
		return true
		
	end
	
	return false
	
end
function 入口_保存并离开()
	--保存离开
	local x , y = findMultiColor(321 , 661 , 433 , 688 , "efe3ce-202020" , "40|0|c59231-202020|20|-1|ce9e4a-202020|-23|3|dec28c-202020|47|5|d6b67b-202020|24|5|dec28c-202020|16|-6|dec28c-202020|-40|8|ce9e4a-202020|36|10|debe84-202020|-17|-10|fffbf7-202020|-36|-2|dec28c-202020|-41|2|efe3ce-202020|-23|-3|c59231-202020|43|10|c59231-202020|1|-9|d6be84-202020" , 0 , 0.9)
	--初始化
	local x1 , y1 = findMultiColor(53 , 657 , 132 , 694 , "636152-202020" , "-2|13|63553a-202020|-12|1|73613a-202020|-33|14|63553a-202020|13|-4|5a5542-202020|9|9|636152-202020|23|11|735d3a-202020|-3|-7|7b613a-202020|-11|-5|73613a-202020|-16|13|6b593a-202020|15|4|735d3a-202020|-27|11|635942-202020|-18|6|63553a-202020|19|-6|5a5542-202020|8|0|6b593a-202020" , 0 , 0.9)
	
	if x ~= - 1 and x1 ~= - 1 then
		显示('保存离开')
		
		按下点击({288 , 653 , 468 , 696})
		return true
		
	end
	
	return false
end
function 入口_自动装备_自动穿装备()
	setDict(0 , "确认.txt")
	useDict(0)
	local ret , x , y = findStr(593 , 599 , 688 , 624 , "自动装备" , "ffffff-303030" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		按下点击({561 , 586 , 721 , 634})
		print('自动装备')
		return true
	end
	
	local ret1 , x1 , y1 = findStr(580 , 70 , 699 , 104 , "自动装备上面" , "fff3bd-303030" , 0.8 , 10 , 10)
	if x1 ~= - 1 and y1 ~= - 1 then
		print('自动装备上面')
		按下点击({561 , 586 , 721 , 634})
		return true
	end
	
	return false
end
function 入口_本次登录不再显示()
	setDict(0 , "界面判断.txt")
	useDict(0)
	local ret , x , y = findStr(685 , 463 , 769 , 488 , "不再显示" , "a48e73-303030" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		print('不再显示')
		按下点击({526 , 468 , 546 , 485})
		随机延时(400 , 500)
		按下点击({670 , 537 , 812 , 579})--确认
		
		return true
	end
	return false
	
end
function 技能详情窗口()
	setDict(0 , "确认.txt")
	useDict(0)
	local ret , x , y = findStr(364 , 61 , 663 , 186 , "技能详情" , "ded7a4-303030|a48e73-303030" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		print('技能详情')
		返回(4)
		return true
	end
	return false
	
end
function 入口_更新_游戏()
	setDict(0 , "确认.txt")
	useDict(0)
	local ret , x , y = findStr(296 , 359 , 995 , 719 , "更新" , "ffffff-202020" , 0.85 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		print('不再显示')
		按下点击(x , y)
		sleep(2000)
		return true
	end
	return false
end
function 入口_连续通关入场()
	setDict(0 , "确认.txt")
	useDict(0)
	local ret , x , y = findStr(629 , 494 , 669 , 515 , "连续通关入场" , "fff7de-303030" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		print('连续通关入场')
		X = x + 50
		Y = y + 5
		按下点击(X , Y , - 50 , 50 , - 5 , 5)
		
		return true
	end
	return false
	
end
-- 修改现有的入口_确认函数，使它支持单次模式
function 入口_确认(单次模式)--如果入口_确认()里面不填true就是还是多次确认 填就就是单词确认
	
	local 最大额外循环次数 = 单次模式 and 0 or 2 -- 如果是单次模式，不进行额外循环
	local 额外循环计数 = 0
	local 继续查找 = true
	local 找到任何确认 = false -- 记录是否找到任何确认
	
	while 继续查找 do
		local 本轮找到确认 = false
		
		if 判断_城镇界面() or 判断_副本中() or 清屏_角色扩展栏提示_不点击() then
			
			return false
		end
		if 入口_更新_游戏() or 判断_更新_下载更新() then
			随机延时(400 , 500)
			本轮找到确认 = true
			找到任何确认 = true
		end
		
		if 同步立即使用领取的物品功能() then
			print('1')
			随机延时(400 , 500)
			本轮找到确认 = true
			找到任何确认 = true
		end
		
		if 入口_自动装备_自动穿装备() then
			print('2')
			随机延时(400 , 500)
			本轮找到确认 = true
			找到任何确认 = true
		end
		if 入口_本次登录不再显示() then
			print('3')
			随机延时(400 , 500)
			本轮找到确认 = true
			找到任何确认 = true
		end
		if 判断_使用冒险团金库物品() then
			print('4')
			随机延时(400 , 500)
			本轮找到确认 = true
			找到任何确认 = true
		end
		if 判断_不再提示() then
			print('不再提示确认')
			--随机延时(600 , 800)
			本轮找到确认 = true
			找到任何确认 = true
		end
		if 入口_关闭技能显示() then
			print('关闭技能名称显示-取消')
			随机延时(400 , 500)
			本轮找到确认 = true
			找到任何确认 = true
		end
		
		if 入口_确认_初始化技能() or 判断_自动完成() then
			print('确认初始化冒险团技能')
			--随机延时(600 , 800)
			本轮找到确认 = true
			找到任何确认 = true
		end
		if 判断_结算界面_深渊组队() then
			print('判断_结算界面_深渊组队')
			本轮找到确认 = true
			找到任何确认 = true
		end
		if 入口_连续通关入场() then
			显示('连续通关入场')
			本轮找到确认 = true
			找到任何确认 = true
		end
		setDict(0 , "字库0.txt")
		useDict(0)
		-- 查找"确认"
		local ret , x , y = findStr(308 , 161 , 983 , 543 , "确认" , "fff3de-202020" , 0.8 , 10 , 10)
		if x ~= - 1 and y ~= - 1 then
			
			print('点击确认')
			显示('点击确认')
			
			按下点击(x , y , - 34 , 80 , - 9 , 29)
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
			
		end
		
		-- 查找"确认2"
		local ret2 , x2 , y2 = findStr(618 , 444 , 661 , 464 , "确认2" , "ffffff-202020" , 0.8 , 10 , 10)
		if x2 ~= - 1 and y2 ~= - 1 --[===[and not 清屏_角色扩展栏提示_不点击()]===] then
			显示('点击确认2')
			--print(x2,y2)
			按下点击(x2 , y2 , - 45 , 85 , - 11 , 31)
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
			
		end
		
		-- 查找"背包确认"
		local ret3 , x3 , y3 = findStr(256 , 136 , 947 , 612 , "背包确认" , "fff3de-202020" , 0.8 , 10 , 10)
		if x3 ~= - 1 and y3 ~= - 1 --[===[and not 清屏_角色扩展栏提示_不点击()]===] then
			显示('点击背包确认')
			--print(x3,y3)
			
			按下点击(x3 , y3 , - 20 , 80 , - 15 , 25)
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
			
		end
		
		-- 查找"确认3"(绑定疲劳确认)
		local ret4 , x4 , y4 = findStr(363 , 217 , 893 , 719 , "确认3" , "fff7e6-202020" , 0.8 , 10 , 10)
		if x4 ~= - 1 and y4 ~= - 1 --[===[and not 清屏_角色扩展栏提示_不点击()]===] then
			显示('点击绑定疲劳确认')
			--print(x4,y4)
			
			按下点击({664 , 466 , 806 , 512})
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
			
		end
		local ret6 , x6 , y6 = findStr(396 , 205 , 919 , 626 , "获得物品确认" , "ffffff-202020" , 0.9 , 10 , 10)
		if x6 ~= - 1 and y6 ~= - 1 --[===[and not 清屏_角色扩展栏提示_不点击()]===] then
			显示('点击获得物品确认')
			--print(x6,y6)
			
			按下点击(x6 , y6 , - 40 , 80 , - 15 , 35)
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
			
		end
		local ret7 , x7 , y7 = findStr(687 , 424 , 734 , 446 , "确定" , "fff3de-202020|f7e3bd-202020" , 0.85 , 10 , 10)
		if x7 ~= - 1 and y7 ~= - 1 then
			显示('确定转职')
			--print(x6,y6)
			
			按下点击({661 , 412 , 809 , 460} , {50 , 200})
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
			
		end
		
		local x8 , y8 = findMultiColor(463 , 596 , 833 , 681 , "bd8a21-202020" , "-10|9|deba7b-202020|7|-12|cea663-202020|18|-13|bd7a1a-202020|20|-4|c59642-202020|-10|-5|f7eee6-202020|14|7|f7eee5-202020|8|7|deba7b-202020|-17|-9|e6d6bc-202020|-15|-1|bd8621-202020|15|1|bd8e32-202020|9|1|cea252-202020|9|-5|bd8a29-202020|-2|9|c58919-202020|-6|4|cea252-202020|21|5|e6dfbd-202020|-1|-7|dec69c-202020|-17|6|f7efde-202020|-6|-13|bd8222-202020" , 0 , 0.9)
		
		if x8 ~= - 1 and y8 ~= - 1 then
			显示('制作确认')
			--print(x6,y6)
			
			按下点击(x8 , y8 , - 61 , 69 , - 23 , 23)
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
			
		end
		local x9 , y9 = findMultiColor(594 , 526 , 676 , 570 , "ffffff-202020" , "11|-5|ffffff-202020|-14|14|bd7d00-202020|-21|4|b57500-202020|-15|5|ffffff-202020|17|-3|b57500-202020|25|17|bd7d00-202020|-18|-3|ad7908-202020|-31|1|b57500-202020|12|3|ffffff-202020|25|6|b57900-202020|-6|5|ffffff-202020|0|-8|efe3ce-202020|-13|-8|ffffff-202020|-11|-7|bd8a2a-202020|-22|-7|deca9d-202020|-24|-6|fffffe-202020|-13|-1|b57908-202020|-7|0|b57500-202020|-7|-5|ffffff-202020|-12|-5|d6b27b-202020" , 0 , 0.9)
		if x9 ~= - 1 and y9 ~= - 1 then
			显示('完成确认')
			按下点击(x8 , y8 , - 61 , 69 , - 23 , 23)
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
		end
		
		local x10 , y10 = findMultiColor(612 , 612 , 667 , 640 , "ffffff-202020" , "17|-6|ffffff-202020|30|7|bd7c00-202020|-9|10|bf7d00-202020|12|-12|af7102-202020|-3|-14|ae7001-202020|-1|10|bf7d00-202020|3|-10|b07300-202020|-23|5|bb7a00-202020|-13|-11|ffffff-202020|-16|-2|ffffff-202020|-3|-8|ffffff-202020" , 0 , 0.9)
		if x10 ~= - 1 and y10 ~= - 1 then
			print('7')
			按下点击(x10 , y10 , - 50 , 50 , - 23 , 23)
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
		end
		
		local x12 , y12 = findMultiColor(704 , 501 , 780 , 541 , "bd7900-202020" , "34|-3|b57500-202020|-11|7|fff3de-202020|-37|-9|fff3de-202020|21|-6|ad7100-202020|4|-17|ad6d00-202020|-19|-22|a46d00-202020|30|10|c57d00-202020|41|-24|a46900-202020|-33|6|f7efd6-202020|-20|-4|fff7de-202020|-33|-21|ad6d00-202020|-61|17|c58100-202020" , 0 , 0.9)
		local x13 , y13 = findMultiColor(516 , 508 , 567 , 538 , "ffdfc5-202020" , "-11|3|ffdfc5-202020|-13|18|ad5500-202020|-15|-3|ffdfc5-202020|29|12|ad5500-202020|-2|-10|a44d08-202020|14|6|ffdfc5-202020|13|14|ad5500-202020|11|-8|9c4d00-202020|3|13|b55500-202020|-7|10|ffdfc5-202020|20|-2|ffe3c5-202020" , 0 , 0.9)
		
		if x12 ~= - 1 and y13 ~= - 1 then
			显示('制作确认12')
			按下点击(x12 , y12 , - 50 , 50 , - 23 , 23)
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
		end
		
		local x14 , y14 = findMultiColor(719 , 436 , 748 , 462 , "fff4df-202020" , "-2|0|fff4df-202020|-2|4|fff4df-202020|-2|7|e0bb78-202020|-1|5|fff4df-202020|7|7|fff4df-202020|6|6|fff4df-202020|14|3|f0dab0-202020|15|-1|fff4df-202020|-1|3|fff4df-202020|-2|-3|e5c892-202020|12|-11|fff4df-202020|10|-7|fff4df-202020|0|-10|fff4df-202020|10|-8|e6cc99-202020" , 0 , 0.9)
		local x15 , y15 = findMultiColor(613 , 243 , 667 , 272 , "fff1b9-202020" , "29|11|fff1b9-202020|29|10|fff1b9-202020|27|7|fff1b9-202020|11|4|d0c496-202020|-9|1|fff1b9-202020|2|-8|b5a981-202020|1|-1|fff1b9-202020|-15|6|fff1b9-202020|-18|13|fff1b9-202020|-12|3|fff1b9-202020|-8|11|fff1b9-202020|-2|12|fff1b9-202020|-11|3|fff1b9-202020|-14|-1|fff1b9-202020" , 0 , 0.9)
		if x14 ~= - 1 and y15 ~= - 1 then --修改技能确认
			print('修改技能确认')
			按下点击({683 , 429 , 803 , 473})
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
		end
		
		setDict(0 , "确认.txt")
		useDict(0)
		local ret16 , x16 , y16 = findStr(300 , 129 , 1004 , 624 , "确认" , "fff4df-303030" , 0.8 , 10 , 10)
		if x16 ~= - 1 and y16 ~= - 1 then
			print('确认16')
			按下点击(x16 , y16 , - 48 , 30 , - 18 , 15)
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
		end
		
		setDict(0 , "确认.txt")
		useDict(0)
		local ret17 , x17 , y17 = findStr(593 , 623 , 694 , 683 , "确认" , "ffffff-202020" , 0.85 , 10 , 10)
		if x17 ~= - 1 and y17~= - 1 then
			print('确认17')
			按下点击(x17 , y17 , - 48 , 30 , - 18 , 15)
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
		end
		
		if 判断_通关确认() then
			print('通关确认')
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
		end
		
		if 入口_返回确认() then
			显示('返回确认')
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
		end
		
		--[===[if 入口_完成确认() then
		显示('完成确认')
		随机延时(300 , 400)
		本轮找到确认 = true
		找到任何确认 = true
		
		end]===]
		
		if 入口_存入确认() then
			显示('存入确认')
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
		end
		if 入口_周常确认() then
			显示('周常确认')
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
		end
		if 入口_挑战结束确认() then
			显示('挑战结束确认')
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
		end
		if 入口_世界领主确认() then
			显示('世界领主挑战结束确认')
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
		end
		if 入口_存放() then
			print('存放')
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
		end
		if 判断_使用冒险团金库物品() then
			print('使用冒险团金库物品')
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
		end
		
		if 入口_提示确认() then
			print('技能变动确认')
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
		end
		if 入口_学习技能确认() then
			print('学习技能确认')
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
		end
		
		local ret8 , x8 , y8 = findStr(615 , 615 , 663 , 639 , "确认" , "ffffff-202020|f7ebde-202020|efdfbd-202020" , 0.85 , 10 , 10)
		if x8 ~= - 1 and y8 ~= - 1 then
			显示('找到并点击了仓库确认')
			
			按下点击(x8 , y8 , - 40 , 80 , - 15 , 35)
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
		end
		setDict(0 , "确认.txt")
		useDict(0)
		local ret9 , x9 , y9 = findStr(684 , 420 , 775 , 478 , "前往" , "fff3de-202020" , 0.9 , 10 , 10)
		if x9 ~= - 1 and y9 ~= - 1 then
			显示('主线:任务前往')
			按下点击(x9 , y9 , - 20 , 30 , - 15 , 15)
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
		end
		if 入口_装备获得确认() then
			print('选择获得物品确认')
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
		end
		if 判断_立即使用确认() then
			print('9')
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
		end
		if 入口_退出() then
			print('10')
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
		end
		if 入口_同意_同意腾旭协议() then
			print('11')
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
		end
		if 入口_自动装备_自动穿装备() then
			print('12')
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
		end
		if 技能详情窗口() then
			print('13')
			随机延时(300 , 400)
			本轮找到确认 = true
			找到任何确认 = true
		end
		-- 单次模式下直接退出循环
		if 单次模式 then
			继续查找 = false
		else
			-- 原有的多次查找逻辑
			if 本轮找到确认 then
				额外循环计数 = 0
				--显示("找到确认按钮，继续查找其他确认")
			else
				-- 本轮没找到任何确认，开始额外循环计数
				额外循环计数 = 额外循环计数 + 2
				
				-- 判断是否达到最大额外循环次数
				if 额外循环计数 >= 最大额外循环次数 then
					继续查找 = false
					--显示("完成所有确认按钮查找")
				end
			end
		end
		
		随机延时(50 , 100)
	end
	
	--显示("确认操作完成")
	return 找到任何确认
end

function 入口_前往可入场_入场()
	-- 循环查找5次
	for i = 1 , 5 do
		local x , y = findMultiColorT(前往可入场)
		if x ~= - 1 and y ~= - 1 then
			--显示('前往可入场，第' .. i .. '次找到')
			随机延时(200 , 1000)
			按下点击({1069 , 634 , 1256 , 686})
			return true
		end
		
		local x2 , y2 = findMultiColorT(委托入场)
		if x2 ~= - 1 and y2 ~= - 1 then
			--显示('委托入场，第' .. i .. '次找到')
			--随机延时(200 , 1000)
			按下点击({1098 , 639 , 1249 , 681})
			return true
		end
		
		local x3 , y3 = findMultiColor(1081 , 653 , 1128 , 683 , "efdbb5-303030" , "7|7|fff7e6-303030|13|11|deb26b-303030|6|2|fff7de-303030|5|1|f7dfb5-303030|11|11|fff7e6-303030|1|1|e6c68c-303030|-22|4|ce9e42-303030|-15|5|fff7e6-303030|-21|-6|cea252-303030|-11|-4|ad7100-303030" , 0 , 0.9)
		if x3 ~= - 1 and y3 ~= - 1 then
			--随机延时(200 , 1000)
			按下点击({1056 , 651 , 1227 , 688})--入场
			return true
		end
		
		local x4 , y4 = findMultiColor(1063 , 652 , 1218 , 686 , "ffdfc5-303030" , "-66|8|efc29c-303030|19|-5|ffdfc5-303030|8|-2|ffdfc5-303030|7|-1|ffdfc5-303030|4|1|ffdfc5-303030|8|12|f7cead-303030|-57|0|ffdfc5-303030|-55|1|ffdfc5-303030|-85|-5|ffdfc5-303030|-25|2|a45100-303030" , 0 , 0.9)
		if x4 ~= - 1 and y4 ~= - 1 then
			--随机延时(200 , 1000)
			按下点击({1058 , 648 , 1230 , 690})--入场
			return true
		end
		
		sleep(150)
	end
	
	显示('没找到前往可入场或委托入场')
	return false
end

function 入口_入场 ()
	setDict(0 , "字库0.txt")
	useDict(0)
	local ret , x , y = findStr(1153 , 649 , 1197 , 670 , "入场" , "fff7e6-202020" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		按下点击({1096 , 634 , 1257 , 687})
		return true
	end
	return false
end

function 入口_结算_返回城镇()
	setDict(0 , "界面判断.txt")
	useDict(0)
	local ret , x , y = findStr(999 , 4 , 1259 , 440 , "结算" , "73aaff-303030" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		显示('入口_结算_返回城镇')
		按下点击(x , y)
		return true
		
	end
	return false
end

function 入口_返回城镇()
	
	显示('执行返回城镇')
	if not 判断_返回城镇1() then
		
		return false
	end
	for i = 1 , 5 do
		setDict(0 , "字库0.txt")
		useDict(0)
		
		local ret , x , y = findStr(1024 , 25 , 1247 , 464 , "返回城镇" , "73aaff-202020" , 0.8 , 10 , 10)
		if x ~= - 1 and y ~= - 1 then
			print('返回城镇界面')
			按下点击(x , y , - 5 , 110 , - 5 , 10)
			return true
		end
		local ret2 , x2 , y2 = findStr(1024 , 25 , 1247 , 464 , "返回城镇" , "73aaff-202020|5a81c5-202020" , 0.8 , 10 , 10)
		if x2 ~= - 1 and y2 ~= - 1 then
			print('返回城镇界面2')
			按下点击(x2 , y2 , - 5 , 110 , - 5 , 10)
			return true
		end
		local ret3 , x3 , y3 = findStr(1024 , 25 , 1247 , 464 , "返回城镇" , "73aaff-202020|638ed6-202020|4a71ad-202020" , 0.8 , 10 , 10)
		if x3 ~= - 1 and y3 ~= - 1 then
			print('返回城镇界面3')
			按下点击(x3 , y3 , - 5 , 110 , - 5 , 10)
			return true
		end
		
		local ret4 , x4 , y4 = findStr( 1024 , 25 , 1247 , 464 , "返回城镇" , "73a6ff-303030" , 0.8 , 10 , 10)
		if x4 ~= - 1 and y4 ~= - 1 then
			print('返回城镇界面4')
			按下点击(x4 , y4 , - 5 , 110 , - 5 , 10)
			return true
		end
		
		sleep(50)
	end
	
	if 入口_结算_返回城镇() then
		
		return false
	end
	--[===[setDict(0 , "字库3.txt")
	useDict(0)
	local ret5 , x5 , y5 = findStr(901 , 61 , 936 , 79 , "背包" , "dee3de-303030|a4a694-303030" , 0.8 , 10 , 10)
	if x5 ~= - 1 and y5 ~= - 1 then
	print('返回城镇界面5')
	
	
	return true
	end]===]
	
	显示('未找到返回城镇入口')
	sleep(500)
	return false
	
end

function 入口_再次挑战()
	
	for i = 1 , 5 do
		setDict(0 , "字库0.txt")
		useDict(0)
		
		--[===[if not 判断_返回城镇1() then
		print('检测再次挑战时未检测到返回城镇')
		return false
		end]===]
		
		local ret , x , y = findStr(1024 , 25 , 1247 , 464 , "再次挑战" , "ffe39c-303030" , 0.8 , 10 , 10)
		if x ~= - 1 and y ~= - 1 then
			显示('---------------------再次挑战1--------------------- ')
			
			print(x , y)
			按下点击(x , y , - 5 , 110 , - 5 , 10)
			
			return true
			
		end
		
		local ret2 , x2 , y2 = findStr(1024 , 25 , 1247 , 464 , "再次挑战" , "ffe7a4-303030|c5b684-303030" , 0.8 , 10 , 10)
		if x2 ~= - 1 and y2 ~= - 1 then
			print('---------------------再次挑战2---------------------')
			
			print(x2 , y2)
			按下点击(x2 , y2 , - 5 , 110 , - 5 , 10)
			
			return true
		end
		
		local ret3 , x3 , y3 = findStr(1024 , 25 , 1247 , 464 , "再次挑战" , "ffe7a4-303030" , 0.8 , 10 , 10)
		if x3 ~= - 1 and y3 ~= - 1 then
			print('---------------------再次挑战3---------------------')
			
			print(x3 , y3)
			按下点击(x3 , y3 , - 5 , 110 , - 5 , 10)
			
			return true
		end
		
		local ret4 , x4 , y4 = findStr(1024 , 25 , 1247 , 464 , "再次挑战" , "ffe7a4-303030" , 0.8 , 10 , 10)
		if x4 ~= - 1 and y4 ~= - 1 then
			print('---------------------再次挑战4----------------------')
			
			print(x4 , y4)
			按下点击( x4 , y4 , - 5 , 110 , - 5 , 10)
			
			return true
		end
		local ret5 , x5 , y5 = findStr(1024 , 25 , 1247 , 464 , "再次挑战" , "ffe7a4-303030" , 0.8 , 10 , 10)
		if x5 ~= - 1 and y5 ~= - 1 then
			显示('---------------------再次挑战5--------------------- ')
			
			按下点击(x5 , y5 , - 1 , 110 , - 5 , 10)
			
			return true
		end
		
		local ret6 , x6 , y6 = findStr(1024 , 25 , 1247 , 464 , "再次挑战" , "ffe7a4-303030|ffe39c-303030" , 0.8 , 10 , 10)
		if x6 ~= - 1 and y6 ~= - 1 then
			print('---------------------再次挑战4--------------------- ')
			
			print(x6 , y6)
			按下点击(x6 , y6 , - 5 , 110 , - 5 , 10)
			
			return true
		end
		
	end
	显示("未找到再次挑战入口")
	return false
end

function 判断_疲劳不足()
	setDict(0 , "界面判断.txt")
	useDict(0)
	local ret , x , y = findStr(589 , 215 , 691 , 237 , "疲劳不足" , "ffffff-303030" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		显示('疲劳不足 ')
		return true
	end
	return false
end

function 入口_再次挑战_特殊()
	setDict(0 , "字库0.txt")
	useDict(0)
	for i = 1 , 5 do
		if not 判断_返回城镇1() then
			
			return false
		end
		local ret , x , y = findStr(1102 , 92 , 1143 , 112 , "再次挑战" , "ffe39c-202020" , 0.85 , 10 , 10)
		if x ~= - 1 and y ~= - 1 then
			显示('再次挑战 ')
			touchUp(0)
			print(x , y)
			按下点击(x , y , - 5 , 110 , - 5 , 10)
			return true
		end
		local ret2 , x2 , y2 = findStr(1031 , 153 , 1240 , 196 , "再次挑战" , "ffe7a4-202020|c5b684-202020" , 0.85 , 10 , 10)
		if x2 ~= - 1 and y2 ~= - 1 then
			print('再次挑战2')
			touchUp(0)
			print(x2 , y2)
			按下点击(x2 , y2 , - 5 , 110 , - 5 , 10)
			return true
		end
		local ret3 , x3 , y3 = findStr(1058 , 87 , 1142 , 107 , "再次挑战" , "ffe7a4-202020" , 0.8 , 10 , 10)
		if x3 ~= - 1 and y3 ~= - 1 then
			print('再次挑战3')
			touchUp(0)
			print(x3 , y3)
			按下点击(x3 , y3 , - 5 , 110 , - 5 , 10)
			return true
		end
		local ret4 , x4 , y4 = findStr(960 , 1 , 1274 , 383 , "再次挑战" , "ffe7a4-202020|ffe39c-202020" , 0.8 , 10 , 10)
		if x4 ~= - 1 and y4 ~= - 1 then
			print('再次挑战4')
			touchUp(0)
			print(x4 , y4)
			按下点击(x4 , y4 , - 5 , 110 , - 5 , 10)
			
			return true
		end
		local ret5 , x5 , y5 = findStr(989 , 2 , 1279 , 356 , "再次挑战" , "ffe7a4-303030" , 0.8 , 10 , 10)
		if x5 ~= - 1 and y5 ~= - 1 then
			显示('再次挑战 ')
			touchUp(0)
			按下点击(x5 , y5 , - 1 , 130 , - 10 , 20)
			return true
		end
		随机延时(50 , 60)
	end
	显示("未找到再次挑战")
	return false
	
end

function 入口_开始游戏()
	
	按下点击({508 , 542 , 770 , 587})--开始游戏
	
end

function 入口_到选择角色界面()
	
	local 已点击城镇设置 = false -- 状态标记：是否已从城镇界面点击设置按钮
	local 发行界面时间 = os.time()
	local 总运行时间 = os.time()
	while true do
		
		随机延时(600 , 700)
		显示('到选择角色界面运行中...')
		if os.time() - 总运行时间 > 180 then
			显示('到选择角色界运行超时')
			关闭(地下城)
			总运行时间 = os.time()
			发行界面时间 = os.time()
		end
		
		if 判断_开始游戏界面() then
			发行界面时间 = os.time()
			按下点击({595 , 503 , 691 , 530})--开始游戏
			
		elseif 判断_启动界面_发行() then
			
			if os.time() - 发行界面时间 > 15 then
				--关闭(地下城)
				keyPress(3)
				发行界面时间 = os.time()
				
			end
			
		elseif 判断_选择角色界面() then
			
			随机延时(300 , 500)
			
			return
			
		elseif 判断_城镇界面() then
			发行界面时间 = os.time()
			显示('打开设置前往选择角色界面')
			按下点击({1241 , 124 , 1267 , 140})
			随机延时(300 , 500)
			已点击城镇设置 = true -- 标记已点击城镇设置，开始等待设置界面
			
		elseif 判断_设置界面() then
			已点击城镇设置 = false -- 检测到设置界面，清除标记恢复正常
			按下点击({808 , 614 , 886 , 670})
			发行界面时间 = os.time()
			
		elseif 判断_副本中() then
			自动刷图()
			发行界面时间 = os.time()
			总运行时间 = os.time()
		elseif 判断_加载界面() then
			
		else
			-- 只有在未点击城镇设置时才执行清屏（避免等待设置界面期间清屏）
			if 清屏(true) then
				
			end
			if 打开(地下城) then
				随机延时(2000 , 3000)
				发行界面时间 = os.time()
				总运行时间 = os.time()
			end
			
		end
		
	end
	
	关闭_HUD()
end
function 入口_到开始游戏界面()
	
	local 已点击城镇设置 = false -- 状态标记：是否已从城镇界面点击设置按钮
	local 发行界面时间 = os.time()
	local 总运行时间 = os.time()
	while true do
		
		随机延时(600 , 700)
		显示('到选择角色界面运行中...')
		if os.time() - 总运行时间 > 180 then
			显示('到选择角色界运行超时')
			关闭(地下城)
			总运行时间 = os.time()
			发行界面时间 = os.time()
		end
		
		if 判断_开始游戏界面() then
			发行界面时间 = os.time()
			
			总运行时间 = os.time()
			
			return 入口_到选择角色界面()
		elseif 判断_启动界面_发行() then
			
			if os.time() - 发行界面时间 > 15 then
				--关闭(地下城)
				keyPress(3)
				发行界面时间 = os.time()
				
			end
			
		elseif 判断_选择角色界面_不用等加载() then
			按下点击({38 , 39 , 55 , 60})--返回
			
		elseif 判断_城镇界面() then
			发行界面时间 = os.time()
			显示('打开设置前往选择角色界面')
			按下点击({1241 , 124 , 1267 , 140})
			随机延时(300 , 500)
			已点击城镇设置 = true -- 标记已点击城镇设置，开始等待设置界面
			总运行时间 = os.time()
		elseif 判断_设置界面() then
			已点击城镇设置 = false -- 检测到设置界面，清除标记恢复正常
			按下点击({808 , 614 , 886 , 670})
			发行界面时间 = os.time()
			总运行时间 = os.time()
		elseif 判断_副本中() then
			自动刷图()
			发行界面时间 = os.time()
			总运行时间 = os.time()
		elseif 判断_加载界面() then
			发行界面时间 = os.time()
		else
			-- 只有在未点击城镇设置时才执行清屏（避免等待设置界面期间清屏）
			if 清屏(true) then
				
			end
			if 打开(地下城) then
				随机延时(2000 , 3000)
				发行界面时间 = os.time()
				总运行时间 = os.time()
			end
			
		end
		
	end
	
	关闭_HUD()
end

function 入口_祥瑞溪谷()--字库_祥瑞
	setDict(0 , "字库0.txt")
	useDict(0)
	local ret , x , y = findStr(189 , 61 , 1279 , 715 , "祥瑞" , "ffc263-202020" , 0.85 , 10 , 10)
	for i = 1 , 5 do
		if x ~= - 1 and y ~= - 1 then--328 , 586 , 370 , 607
			--显示('进入祥瑞溪谷')
			按下点击(x , y , - 113 , 361 , - 32 , 81)
			return true
		end
		sleep(50)
	end
	显示('没有找到祥瑞溪谷')
	return false
end
function 入口_哥布林()
	setDict(0 , "字库0.txt")
	useDict(0)
	local ret , x , y = findStr(198 , 63 , 1106 , 710 , "哥布林" , "ffc263-202020" , 0.8 , 10 , 10)
	for i = 1 , 5 do
		if x ~= - 1 and y ~= - 1 then--328 , 586 , 370 , 607
			显示('进入哥布林')
			按下点击(x , y , - 104 , 360 , - 25 , 83)
			return true
		end
		-- 如果不是最后一次查找，稍微延时再继续
		sleep(50)
	end
	显示("没有找到哥布林")
	return false
end
function 入口_哥布林已完成()
	
	setDict(0 , "字库0.txt")
	useDict(0)
	local ret , x , y = findStr(198 , 63 , 1106 , 710 , "哥布林" , "9c753a-202020" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		显示('哥布林已完成')
		
		return true
	end
	return false
end
function 入口_日程表_任务()
	
	--按下点击({983,102,1012,150})
	for i = 1 , 10 do
		local x , y = findMultiColor(910 , 93 , 1108 , 161 , "84554a-202020" , "4|-5|8c715a-202020|10|-12|735542-202020|6|2|3a2821-202020|-9|-9|734d42-202020|-2|-9|5a4131-202020|4|-12|422821-202020|5|8|5a4131-202020|-9|9|8c594a-202020|-7|-1|8c5d4a-202020|10|12|3a2421-202020|0|14|8c594a-202020|-3|-16|000000-202020|10|-3|292819-202020|-9|-16|000000-202020|12|3|3a2421-202020|-3|8|4a0c00-202020" , 0 , 0.9)
		if x ~= - 1 and y ~= - 1 then
			随机延时(400 , 600)
			按下点击(x , y , - 10 , 15 , - 20 , 20)
			for i = 1 , 10 do
				if 判断_日程表界面() then
					显示('成功进入日程表界面')
					break
				end
				sleep(1000)
			end
			
			return true
		end
		
		sleep(1000)
	end
	
	return false
	
end

function 入口_背包()
	按下点击({1193 , 632 , 1237 , 676})--背包
end

function 入口_圣者封印()
	local x , y = findMultiColorT(圣者封印)
	if x ~= - 1 and y ~= - 1 then
		--随机延时(400 , 600)
		按下点击({8 , 292 , 120 , 342})--圣者封印
		return true
	else
		--显示('没找到背包入口')
		return false
		
	end
	
end

function 入口_修理()
	setDict(0 , "字库0.txt")
	useDict(0)
	local ret , x , y = findStr(1047 , 617 , 1092 , 638 , "修理" , "fff3de-202020" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		按下点击({963 , 602 , 1174 , 655})
		return true
	else
		显示('没找到修理按钮')
	end
	return false
end

function 入口_商城()
	local x , y = findMultiColorT(城镇_商城)
	if x ~= - 1 and y ~= - 1 then
		--显示('打开商城')
		按下点击({980 , 31 , 1018 , 66})
		随机延时(1500 , 2000)
		按下点击(87 , 692)--特别关注
		随机延时(1500 , 2000)
		按下点击(1162 , 666)--点击购买
		随机延时(1500 , 2000)
		入口_确认()
		随机延时(1500 , 2000)
		入口_确认()
		随机延时(1500 , 2000)
		按下点击({14 , 15 , 99 , 38})
		清屏()
		return true
	else
		--显示('没找到商城入口')
		return false
	end
	
end
function 入口_金库()
	
	setDict(0 , "字库2.txt")
	useDict(0)
	local ret , x , y = findStr(2 , 189 , 78 , 507 , "金库" , "a48e73-202020" , 0.85 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		--显示('进入金库')
		--print(x,y)
		按下点击(x , y , - 12 , 103 , - 18 , 37)
		return true
	end
	
	return false
end

function 入口_洛兰1()--字库洛兰
	
	setDict(0 , "字库0.txt")
	useDict(0)
	local ret , x , y = findStr(62 , 286 , 298 , 661 , "洛兰" , "ffffff-202020" , 0.9 , 1 , 1)
	if x ~= - 1 and y ~= - 1 then
		-- 显示找到的实际位置
		
		-- 计算点击位置
		local 点击X = x + 110
		local 点击Y = y + 38
		
		按下点击(点击X , 点击Y , - 105 , 105 , - 38 , 40)
		
		--显示('完成洛兰点击')
		return true
	end
	return false
end

function 入口_洛兰()
	setDict(0 , "字库2.txt")
	useDict(0)
	for i = 1 , 5 do
		
		local x3 , y3 = findMultiColor(61 , 287 , 302 , 628 , "8c796b-202020" , "-2|7|847163-202020|-5|9|4a453a-202020|-8|13|42413a-202020|-12|18|3a4131-202020|-15|25|4a593a-202020|-19|29|63714a-202020|-26|34|739263-202020|-28|38|294131-202020|-33|41|426142-202020|-13|38|313131-202020|-5|35|292829-202020|4|25|524942-202020|14|5|42453a-202020|27|-2|3a2d29-202020|21|-4|4a3531-202020" , 0 , 0.9)
		if x3 ~= - 1 and y3 ~= - 1 then
			显示('洛兰4')
			按下点击(x3 , y3 , - 128 , 78 , - 32 , 60)
			return true
		end
		
		local ret , x , y = findStr(61 , 287 , 302 , 628 , "洛兰" , "ffffff-202020" , 0.85 , 1 , 1)
		if x ~= - 1 and y ~= - 1 then
			显示("洛兰")
			按下点击(x , y , - 1 , 20 , - 1 , 60)
			--随机延时(200 , 300)
			return true
		end
		
		local	x1 , y1 = findMultiColor(61 , 287 , 302 , 628 , "8c9663-202020" , "-9|10|849a6b-202020|-5|3|8c966b-202020|-7|7|adae7b-202020|-7|9|849a63-202020|-4|6|9c9e73-202020|-4|5|9c9e73-202020|-5|4|a4a673-202020|-3|1|8c966b-202020|0|-2|8c9663-202020|1|-1|9c9e6b-202020|3|0|9c9a6b-202020|1|-2|949663-202020|17|-10|a4927b-202020|18|-11|9c8a73-202020|16|-26|73695a-202020|16|-37|3a3531-202020|16|-45|4a413a-202020|7|-56|423d3a-202020" , 0 , 0.9)
		if x1 ~= - 1 and y1 ~= - 1 then
			显示("洛兰2")
			按下点击(x1 , y1 , - 113 , 89 , - 49 , 33)
			--随机延时(200 , 300)
			return true
		end
		setDict(0 , "字库0.txt")
		useDict(0)
		local ret2 , x2 , y2 = findStr(61 , 287 , 302 , 628 , "洛兰" , "ffffff-202020" , 0.85 , 1 , 1)
		if x2 ~= - 1 and y2 ~= - 1 then
			-- 显示找到的实际位置
			显示("洛兰3")
			按下点击(x2 , y2 , - 1 , 20 , - 1 , 60)
			--随机延时(200 , 300)
			--显示('完成洛兰点击')
			return true
		end
		
		随机延时(50 , 80)
	end
	print("尝试3次后仍未找到洛兰，退出查找")
	return false
end

function 判断_已选中洛兰()
	for i = 1 , 5 do
		local x , y = findMultiColor(1057 , 217 , 1118 , 249 , "fffcce-303030" , "33|11|fffcce-303030|-15|6|fffcce-303030|-17|10|c8c4a2-303030|-16|14|fffcce-303030|-15|10|fffcce-303030|12|5|fffcce-303030|-17|-9|fffcce-303030|-17|-8|fffcce-303030|14|-10|d2ceaa-303030|32|-5|fffcce-303030|26|-9|fffcce-303030|-9|2|fffcce-303030|4|14|fffcce-303030|3|10|fffcce-303030" , 0 , 0.9)
		if x ~= - 1 and y ~= - 1 then
			return true
		end
		sleep(100)
	end
	
	return false
end

function 入口_区域移动()
	local x , y = findMultiColorT(区域移动)
	if x ~= - 1 and y ~= - 1 then
		--print(x,y)
		按下点击(x , y , - 41 , 51 , - 22 , 33)
		--随机延时(2500 , 3000)
		return true
	end
	return false
end
function 入口_关燃烧疲劳()--字库开
	
	local x , y = findMultiColor(1095 , 511 , 1206 , 554 , "ceaa39-202020" , "-3|2|c6a239-202020|6|-2|d6b239-202020|6|-1|d6ae39-202020|3|2|c6a239-202020|7|2|c6a239-202020|7|-3|deb639-202020|-8|0|ceaa39-202020|-9|-2|c6a631-202020|-8|-3|ceaa31-202020|1|6|210c00-202020|2|10|210c00-202020|-7|10|210c00-202020|-5|4|210c00-202020" , 0 , 0.9)
	if x ~= - 1 and y ~= - 1 then
		显示('关60级副本燃烧疲劳')
		按下点击({1150 , 521 , 1190 , 542})
		return true
	end
	
	setDict(0 , "界面判断.txt")
	useDict(0)
	local ret3 , x3 , y3 = findStr(1071 , 0 , 1279 , 162 , "开" , "210c00-303030" , 0.8 , 10 , 10)
	if x3 ~= - 1 and y3 ~= - 1 then
		显示('关70级副本燃烧疲劳')
		按下点击(x3 , y3)
		return true
	end
	local x2 , y2 = findMultiColor(771 , 639 , 883 , 679 , "ceaa3a-202020" , "0|2|c5a23a-202020|3|2|c5a23a-202020|3|0|ceaa3a-202020|-8|-3|d6b23a-202020|-6|2|c5a23a-202020|-4|2|c5a23a-202020|-5|0|ceaa3a-202020|-6|-1|ceaa3a-202020|8|-3|ceaa3a-202020|9|-2|d6b23a-202020|8|0|ceaa3a-202020|6|0|cea63a-202020|7|2|c5a23a-202020|11|2|c5a23a-202020" , 0 , 0.9)
	if x2 ~= - 1 and y2 ~= - 1 then--开字
		显示('关委托副本燃烧疲劳')
		按下点击({834 , 649 , 871 , 670})
	end
	
	return false
end
function 入口_开燃烧疲劳()--字库关
	
	local x , y = findMultiColor(1095 , 511 , 1206 , 554 , "d6d7d6-202020" , "-1|4|d6d7d6-202020|-2|9|d6d7d6-202020|-3|10|d6d7d6-202020|3|6|a5a6a5-202020|3|4|d6d7d6-202020|5|0|d6d7d6-202020|4|-1|d6d7d6-202020|5|-3|d6d7d6-202020|2|0|d6d7d6-202020" , 0 , 0.9)
	if x ~= - 1 and y ~= - 1 then
		显示('开60级副本燃烧疲劳')
		按下点击({1110 , 522 , 1144 , 541})
		
		return true
	end
	setDict(0 , "界面判断.txt")
	useDict(0)
	local ret3 , x3 , y3 = findStr(1071 , 0 , 1279 , 162 , "关" , "d6d2d6-303030" , 0.8 , 10 , 10)
	if x3 ~= - 1 and y3 ~= - 1 then
		显示('开70级副本燃烧疲劳')
		按下点击(x3 , y3)
		return true
	end
	
	local x2 , y2 = findMultiColor(771 , 639 , 883 , 679 , "c5c6c5-202020" , "-2|-8|d6d7d6-202020|-4|-6|d6d7d6-202020|-1|-6|d6d7d6-202020|-5|-1|a4aaa4-202020|-3|3|d6d7d6-202020|-5|4|d6d7d6-202020|5|4|d6d7d6-202020|7|4|d6d7d6-202020|5|3|d6d7d6-202020|4|-1|adaead-202020|8|-2|d6d7d6-202020|7|-6|d6d7d6-202020|6|-9|adaead-202020|1|-6|d6d7d6-202020" , 0 , 0.9)
	if x2 ~= - 1 and y2 ~= - 1 then---关字
		显示('开委托副本燃烧疲劳')
		按下点击({791 , 649 , 827 , 669})
		return true
	end
	
	return false
end
function 入口_关可交易()--字库开
	setDict(0 , "字库0.txt")
	useDict(0)
	local ret , x , y = findStr(1109 , 542 , 1191 , 567 , "开" , "211008-202020" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		按下点击({1109 , 542 , 1191 , 567})
		return true
	end
	local x2 , y2 = findMultiColor(825 , 664 , 882 , 696 , "cea63a-202020" , "-2|-1|c5a63a-202020|-2|0|c5a63a-202020|1|1|c5a642-202020|7|-3|d6b242-202020|7|-2|ceae3a-202020|6|-1|ceaa3a-202020|4|-1|c5a63a-202020|5|1|c5a642-202020|6|0|cea63a-202020|7|1|c5a642-202020|-7|1|c5a642-202020|-6|0|cea63a-202020|-5|-1|ceaa42-202020|-7|-1|ceaa42-202020" , 0 , 0.8)
	if x2 ~= - 1 and y2 ~= - 1 then--开字特征
		显示('关可交易')
		--随机延时(200 , 300)
		按下点击({835 , 670 , 871 , 690})--点击开就是关
		return true
	end
	return false
end
function 入口_关可交易2()--开字
	
	local x , y = findMultiColor(825 , 664 , 882 , 696 , "cea63a-202020" , "-2|-1|c5a63a-202020|-2|0|c5a63a-202020|1|1|c5a642-202020|7|-3|d6b242-202020|7|-2|ceae3a-202020|6|-1|ceaa3a-202020|4|-1|c5a63a-202020|5|1|c5a642-202020|6|0|cea63a-202020|7|1|c5a642-202020|-7|1|c5a642-202020|-6|0|cea63a-202020|-5|-1|ceaa42-202020|-7|-1|ceaa42-202020" , 0 , 0.8)
	if x ~= - 1 and y ~= - 1 then
		显示('关可交易')
		--随机延时(200 , 300)
		按下点击({835 , 670 , 871 , 690})--点击开就是关
		return true
	end
	return false
end

function 入口_开可交易()
	setDict(0 , "字库0.txt")
	useDict(0)
	local ret , x , y = findStr(1109 , 542 , 1191 , 567 , "关" , "d6d7d6-202020|a4a6a4-202020" , 0.8 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		--显示('开可交易')
		
		按下点击({1109 , 542 , 1191 , 567})
		return true
		
	end
	
	local x , y = findMultiColor(780 , 663 , 841 , 699 , "d6d7d6-202020" , "-3|-5|d6d7d6-202020|-3|-3|adb2ad-202020|-4|-2|d6d2d6-202020|-5|-2|d6d7d6-202020|-1|2|d6d7d6-202020|-1|4|c5c6c5-202020|-4|7|adaaad-202020|-6|8|ced2ce-202020|0|5|d6d7d6-202020|7|3|d6d7d6-202020|7|2|d6d7d6-202020|6|-1|d6d7d6-202020|4|-5|d6d7d6-202020|-2|-3|d6d7d6-202020" , 0 , 0.9)
	if x ~= - 1 and y ~= - 1 then--关字特征
		显示('开可交易')
		按下点击({793 , 670 , 824 , 691})--点击关就是开
		return true
	end
	return false
	
end
function 入口_开可交易2()--关字特征()
	
	local x , y = findMultiColor(780 , 663 , 841 , 699 , "d6d7d6-202020" , "-3|-5|d6d7d6-202020|-3|-3|adb2ad-202020|-4|-2|d6d2d6-202020|-5|-2|d6d7d6-202020|-1|2|d6d7d6-202020|-1|4|c5c6c5-202020|-4|7|adaaad-202020|-6|8|ced2ce-202020|0|5|d6d7d6-202020|7|3|d6d7d6-202020|7|2|d6d7d6-202020|6|-1|d6d7d6-202020|4|-5|d6d7d6-202020|-2|-3|d6d7d6-202020" , 0 , 0.9)
	if x ~= - 1 and y ~= - 1 then
		显示('开可交易')
		按下点击({793 , 670 , 824 , 691})--点击关就是开
		return true
	end
	return false
end
function 入口_战斗开始()
	setDict(0 , "字库0.txt")
	useDict(0)
	local ret , x , y = findStr(892 , 583 , 1238 , 693 , "战斗开始" , "fff3de-202020|f7e3c5-202020" , 0.85 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		--随机延时(500 , 1000)
		return true
	end
	
	return false
end
function 随机_频道()
	-- 定义所有频道的坐标
	local 频道坐标 = {
		{210 , 74 , 425 , 128} , -- 频道1
		{470 , 76 , 674 , 124} , -- 频道2
		{711 , 71 , 922 , 123} , -- 频道3
		{964 , 71 , 1171 , 123} , -- 频道4
		{206 , 150 , 423 , 212} , -- 频道5
		{462 , 155 , 671 , 202} , -- 频道6
		{710 , 158 , 918 , 205} , -- 频道7
		{965 , 155 , 1169 , 204} -- 频道8
	}
	
	-- 初始化随机数种子
	math.randomseed(os.time())
	
	-- 随机选择一个频道索引 (1-8)
	local 随机索引 = math.random(1 , #频道坐标)
	
	-- 获取选择的频道坐标
	local 选择坐标 = 频道坐标[随机索引]
	
	-- 显示选择的频道
	--显示("随机选择了频道 " .. 随机索引)
	
	-- 点击选择的频道
	按下点击(选择坐标)
	
	-- 返回选择的频道号
	return 随机索引
end
function 入口_选择频道()
	
	while true do
		快速检测游戏状态()
		随机延时(400 , 700)
		显示('选择频道中...')
		if 判断_城镇界面() then
			按下点击({1241 , 122 , 1261 , 143})--设置
			随机延时(500 , 800)
			
		elseif 判断_设置界面() then
			
			按下点击({680 , 605 , 774 , 677})--选择频道
			随机延时(1000 , 2000)
			随机_频道()
			随机延时(500 , 800)
			按下点击({1064 , 644 , 1247 , 694})--选择频道
			随机延时(1500 , 3000)
			清屏()
			break
			
		else
			if 清屏(true) then
				随机延时(400 , 700)
			end
			
		end
		
	end
	
end
function 入口_委托特殊()
	setDict(0 , "字库0.txt")
	useDict(0)
	local ret , x , y = findStr(0 , 50 , 149 , 676 , "特殊" , "a49273-202020" , 0.85 , 10 , 10)
	if x ~= - 1 and y ~= - 1 then
		按下点击(x , y , - 9 , 113 , - 19 , 36)
		return true
	end
	
	return false
end

function 入口_黑色大地()
	setDict(0 , "字库0.txt")
	useDict(0)
	
	for i = 1 , 5 do
		local ret , x , y = findStr(191 , 64 , 1262 , 680 , "黑色大地战场" , "ffc263-303030" , 0.9 , 10 , 10)
		if x ~= - 1 and y ~= - 1 then
			
			按下点击(x , y , - 119 , 372 , - 35 , 83)
			return true
		end
		
		local x1 , y1 = findMultiColor(189 , 57 , 1279 , 719 , "211821-202020" , "-4|-12|3a3d42-202020|-2|-22|313d42-202020|5|-38|292d31-202020|21|-27|3a4552-202020|31|-18|312d3a-202020|57|-2|3a3d5a-202020|58|24|42455a-202020|40|18|3a3d4a-202020|50|4|3a394a-202020|72|-47|191019-202020|73|-39|211821-202020|66|-31|191421-202020|56|-35|191421-202020|66|-21|634142-202020|72|-7|312431-202020|77|-12|312429-202020|84|0|5a757b-202020|82|18|191421-202020|87|38|3a2021-202020|69|25|3a3d52-202020|67|5|31455a-202020|87|-6|526973-202020" , 0 , 0.9)
		if x1 ~= - 1 and y1 ~= - 1 then
			按下点击(x1 , y1 , - 336 , 122 , - 63 , 64)
		end
		随机延时(150 , 200)
	end
	
	print('5次都没找到黑色大地战场')
	return false
end

function 入口_诺伊佩拉()
	setDict(0 , "字库0.txt")
	useDict(0)
	
	-- 循环查找5次
	for i = 1 , 5 do
		local ret , x , y = findStr(63 , 250 , 562 , 668 , "诺伊佩拉" , "ffffff-202020|f7f7f7-202020|ffffff-202020|cecece-202020|efefef-202020" , 0.85 , 10 , 10)
		if x ~= - 1 and y ~= - 1 then
			按下点击(x , y , 1 , 215 , - 2 , 81)
			return true
		end
		
		-- 如果没找到且不是最后一次，等待一下再试
		
		随机延时(50 , 80)
		
	end
	
	return false
end
function 入口_无法地带()
	setDict(0 , "字库2.txt")
	useDict(0)
	for i = 1 , 5 do
		
		local x2 , y2 = findMultiColor(305 , 243 , 544 , 587 , "ffffff-202020" , "21|10|ffffff-202020|30|3|ffffff-202020|-35|7|eff3ef-202020|-29|10|ffffff-202020|-33|5|ced2ce-202020|-26|1|ffffff-202020|25|-6|cecace-202020|24|-4|ffffff-202020|20|-5|ffffff-202020|-5|8|ffffff-202020|6|5|ffffff-202020|2|2|ffffff-202020|-9|10|b5b2b5-202020|-12|-1|ffffff-202020" , 0 , 0.9)
		if x2 ~= - 1 and y2 ~= - 1 then
			print('2')
			--随机延时(200 , 500)
			按下点击(x2 , y2 , - 26 , 169 , - 7 , 40)
			
			return true
		end
		
		local x3 , y3 = findMultiColor(305 , 243 , 544 , 587 , "ffffff-202020" , "33|9|adaead-202020|35|8|ffffff-202020|40|7|c5c2c5-202020|-9|5|ffffff-202020|-23|-1|ffffff-202020|-24|6|ffffff-202020|-31|13|ffffff-202020|-23|13|ffffff-202020|-21|6|ffffff-202020|-7|-1|ffffff-202020|36|-2|f7fbf7-202020|32|-2|ffffff-202020|8|3|ffffff-202020|-2|6|ffffff-202020" , 0 , 0.9)
		if x3 ~= - 1 and y3 ~= - 1 then
			print('3')
			--随机延时(200 , 500)
			按下点击(x3 , y3 , - 26 , 169 , - 7 , 40)
			随机延时(200 , 500)
			return true
		end
		
		local x4 , y4 = findMultiColor(305 , 243 , 544 , 587 , "ffffff-202020" , "41|6|b5b6b5-202020|-23|2|ffffff-202020|-21|4|ffffff-202020|-15|5|ffffff-202020|-19|-6|ffffff-202020|44|-5|ffffff-202020|15|9|e6e3e6-202020|21|8|ffffff-202020|1|-5|ffffff-202020" , 0 , 0.9)
		if x4 ~= - 1 and y4 ~= - 1 then
			print('4')
			--随机延时(200 , 500)
			按下点击(x4 , y4 , - 26 , 167 , - 7 , 40)
			随机延时(200 , 500)
		end
		
		local ret , x , y = findStr(305 , 243 , 544 , 587 , "" , "ffffff-202020" , 0.9 , 10 , 10)
		if x ~= - 1 and y ~= - 1 then
			print('无法地带')
			--随机延时(200 , 500)
			按下点击(x , y , - 4 , 215 , - 2 , 40)
			return true
		end
		随机延时(50 , 80)
	end
	return false
end
function 判断_已选中无法地带()
	
	local x , y = findMultiColor(1030 , 216 , 1144 , 247 , "ada28c-202020" , "-32|5|c5c29c-202020|22|0|ffffce-202020|33|1|fffbce-202020|-59|-8|fffbce-202020|-41|13|b5ae94-202020|31|-6|fffbce-202020|39|-11|fffbce-202020|-3|9|fffbce-202020|-1|-3|fffbce-202020|13|13|adaa8c-202020|5|-3|fffbce-202020|-21|-7|fffbce-202020|-20|5|fffbce-202020|-17|1|fffbce-202020" , 0 , 0.9)
	if x ~= - 1 and y ~= - 1 then
		return true
	end
	return false
end

function 入口_诺斯玛尔()
	
	for i = 1 , 5 do
		local x , y = findMultiColor(308 , 279 , 401 , 626 , "ffffff-202020" , "40|-3|ffffff-202020|14|0|bdc2bd-202020|15|5|ffffff-202020|17|-1|ffffff-202020|27|-3|ffffff-202020|28|-4|ffffff-202020|29|-8|ffffff-202020|-5|-6|ffffff-202020|-6|6|ffffff-202020|-4|4|e6e3e6-202020|7|4|ffffff-202020|9|-8|d6d7d6-202020|-4|-2|ffffff-202020|-3|0|ffffff-202020|-17|-6|ffffff-202020|-18|1|ffffff-202020|-16|-5|ffffff-202020|-11|-4|ffffff-202020|-15|-7|c5c6c5-202020" , 0 , 0.9)
		if x ~= - 1 and y ~= - 1 then
			按下点击(x , y , - 4 , 140 , - 2 , 15)
			return true
		end
		local x1 , y1 = findMultiColor(308 , 279 , 401 , 626 , "d6ced6-202020" , "33|5|b5b2b5-202020|35|5|f7fbf7-202020|28|5|ffffff-202020|6|1|ffffff-202020|7|-5|ffffff-202020|10|-3|adaead-202020|-34|0|ffffff-202020|-32|10|efefef-202020|-23|10|dee3de-202020|-21|-6|ffffff-202020|-32|-4|ffffff-202020|35|-4|ffffff-202020|-15|-2|ffffff-202020|-17|8|ffffff-202020|-12|9|ffffff-202020|0|-6|ffffff-202020|-10|1|bdbabd-202020|-13|7|ffffff-202020|-12|-1|ffffff-202020" , 0 , 0.9)
		if x1 ~= - 1 and y1 ~= - 1 then
			
			按下点击(x1 , y1 , - 4 , 140 , - 2 , 15)
			return true
		end
		
		setDict(0 , "字库2.txt")
		useDict(0)
		local ret3 , x3 , y3 = findStr(308 , 279 , 401 , 626 , "诺斯玛尔" , "ffffff-303030" , 0.85 , 10 , 10)
		if x3 ~= - 1 and y3 ~= - 1 then
			
			按下点击(x3 , y3 , - 4 , 140 , - 2 , 15)
			return true
		end
	end
	return false
end

function 入口_暴走研究所()
	setDict(0 , "字库0.txt")
	useDict(0)
	
	for i = 1 , 5 do
		local ret , x , y = findStr(180 , 60 , 1274 , 719 , "暴走研究所" , "ffc263-202020" , 0.9 , 10 , 10)
		if x ~= - 1 and y ~= - 1 then
			print("第" .. i .. "次尝试找到暴走研究所，坐标: " .. x .. ", " .. y)
			按下点击(x , y , - 131 , 294 , - 9 , 89)
			return true
		end
		
		local x2 , y2 = findMultiColor(186 , 50 , 1279 , 719 , "312421-202020" , "26|24|42393a-202020|41|22|423d42-202020|55|27|4a4952-202020|50|-7|3a354a-202020|16|-10|211829-202020|97|-19|314563-202020|133|-19|844531-202020|135|0|8c8a3a-202020|131|15|848663-202020|157|36|7b5184-202020|166|14|4a3984-202020|160|-4|94866b-202020|182|15|63868c-202020|206|29|8c8e8c-202020|189|51|3a4d8c-202020|135|61|21397b-202020|117|47|4a3163-202020|134|-8|84867b-202020|136|-37|31397b-202020|129|-52|5a8684-202020|84|-48|6b595a-202020|83|-21|636563-202020" , 0 , 0.9)
		
		if x2 ~= - 1 and y2 ~= - 1 then
			按下点击(x2 , y2 , - 259 , 214 , - 57 , 71)
			return true
		end
		
		print("第" .. i .. "次尝试未找到暴走研究所，继续尝试...")
		sleep(50)
	end
	
	显示("连续5次未找到暴走研究所入口，退出")
	return false
end

function 入口_深渊()
	
	for i = 1 , 5 do
		
		local x2 , y2 = findMultiColor(188 , 71 , 1028 , 665 , "ffc263-202020" , "26|1|ffc263-202020|-68|1|ffc263-202020|35|5|ffc263-202020|36|3|ffc263-202020|38|-2|ffc263-202020|-68|-3|ffc263-202020|22|-6|ffc263-202020|23|-3|ffc263-202020|16|-8|ffc263-202020|-4|-8|ffc263-202020|7|5|ffc263-202020|-35|3|ffc263-202020|-36|-7|ffc263-202020|-38|-7|ffc263-202020|57|-10|ffc263-202020|56|5|5a4931-202020|71|5|7b6142-202020|73|2|ffc263-202020" , 0 , 0.9)
		if x2 ~= - 1 and y2 ~= - 1 then
			
			按下点击(x2 , y2 , - 183 , 250 , - 51 , 64)
			return true
		else
			显示("连未找到深渊失调次元")
		end
		
		sleep(70)
	end
	显示("连续5次未找到深渊失调次元")
	return false
	
end

function 判断_已选中能源中心()
	
	local x , y = findMultiColor(1029 , 216 , 1141 , 246 , "fffbce-202020" , "-60|13|ffffce-202020|-53|18|b5b294-202020|20|4|fffbce-202020|21|4|fffbce-202020|37|4|c5c2a4-202020|38|5|ffffce-202020|39|8|b5ae8c-202020|-32|4|fffbce-202020|38|13|ffffce-202020|-32|17|ffffce-202020|27|-5|cec6a4-202020|-46|5|c5ba9c-202020|-40|0|fffbce-202020|-41|-5|fffbce-202020" , 0 , 0.9)
	if x ~= - 1 and y ~= - 1 then
		print('已选中能源中心')
		return true
	end
	return false
end

function 入口_能源中心()
	
	for i = 1 , 3 do
		
		local x , y = findMultiColor(70 , 196 , 534 , 664 , "312029-202020" , "-7|-1|312829-202020|-9|7|312429-202020|-1|9|3a2831-202020|1|6|292429-202020|8|6|312029-202020|22|2|5a3121-202020|27|-2|211c21-202020|27|-11|292029-202020|23|-16|292029-202020|16|-22|6b4131-202020|-18|15|633929-202020|-18|26|734131-202020|-10|33|7b4531-202020|5|28|734531-202020|12|25|4a2821-202020|24|29|4a2821-202020|-41|5|292021-202020|-51|2|292021-202020|-52|8|212021-202020|-47|12|313142-202020|-47|21|292021-202020|-35|17|3a2829-202020|-37|-37|202020-202020|-31|-31|ffffff-202020|-30|-27|ffffff-202020|-40|-33|efebef-202020|-45|-26|ffffff-202020|-34|-26|191419-202020|-43|-21|6b6d6b-202020|-36|-22|5a5d5a-202020|-38|-24|211c19-202020|-41|-33|191410-202020" , 0 , 0.9)
		if x ~= - 1 and y ~= - 1 then
			显示("能源中心")
			按下点击(x , y , - 50 , 50 , - 30 , 30)
			return true
		end
		
		local x2 , y2 = findMultiColor(56 , 227 , 577 , 661 , "312429-202020" , "-8|3|292021-202020|-6|11|3a2829-202020|4|12|3a2429-202020|12|6|312829-202020|17|3|3a2d31-202020|18|11|312429-202020|14|25|422419-202020|6|30|5a3121-202020|-8|25|5a3529-202020|-21|24|6b3d31-202020|-26|21|523129-202020|-33|17|4a3131-202020|-41|15|3a2829-202020|-47|9|4a393a-202020|-55|14|29313a-202020|-61|-2|312421-202020|-58|-12|292021-202020|-51|-25|191419-202020|-45|-32|191819-202020|-48|-22|191819-202020|-43|-18|ffffff-202020|-39|-22|bdc2bd-202020|-37|-25|191819-202020|-42|-23|211819-202020|-45|-21|191819-202020|-40|-34|191410-202020|-40|-29|b5b6b5-202020|-42|-33|fffff7-202020" , 0 , 0.9)
		if x2 ~= - 1 and y2 ~= - 1 then
			显示("能源中心2")
			按下点击(x2 , y2 , - 50 , 50 , - 30 , 30)
			return true
		end
		
		sleep(50)
	end
	
	print("尝试3次后仍未找到能源中心，退出查找")
	return false
end
function 入口_安特贝鲁()
	
	for i = 1 , 5 do
		
		local x , y = findMultiColor(306 , 268 , 450 , 598 , "ffffff-202020" , "-4|12|cec6c5-202020|-24|12|ffffff-202020|-15|8|ffffff-202020|-52|0|ffffff-202020|37|11|ffffff-202020|38|6|ffffff-202020|43|0|ffffff-202020|37|-1|ffffff-202020|22|1|a4a2a4-202020|18|7|eff3ef-202020|30|-2|ffffff-202020|29|-3|ffffff-202020|-37|5|ffffff-202020|-50|-5|ced2ce-202020" , 0 , 0.9)
		if x ~= - 1 and y ~= - 1 then
			按下点击(x , y , - 60 , 129 , - 1 , - 42)
			return true
		end
		
		sleep(100)
	end
	return false
end
function 判断_安特贝鲁_已选中()
	
	local x , y = findMultiColor(1004 , 215 , 1171 , 250 , "fffbce-202020" , "42|11|fffbce-202020|71|14|fffbce-202020|53|16|fffbce-202020|23|19|ffffce-202020|39|6|fffbce-202020|27|19|ffffce-202020|26|18|fffbce-202020|11|2|fffbce-202020|-37|4|fffbce-202020|-61|10|bdbe94-202020|-60|15|fffbce-202020|-81|13|ffffce-202020|-78|22|fffbce-202020|-77|17|ffffce-202020" , 0 , 0.9)
	if x ~= - 1 and y ~= - 1 then
		return true
	end
	return false
end
function 判断_已选中温特科技园()
	
	local x , y = findMultiColor(1017 , 214 , 1157 , 250 , "fffbce-202020" , "-66|14|fffbce-202020|3|4|bdba9c-202020|61|5|e6e3bd-202020|50|6|fffbce-202020|55|4|ffffce-202020|-10|4|fffbce-202020|-7|-5|fffbce-202020|-44|1|dedbb5-202020|34|-5|fffbce-202020|21|-7|efefc5-202020|-24|-5|fffbce-202020|-36|7|f7f3c5-202020|-21|5|fffbce-202020|-33|3|efebbd-202020" , 0 , 0.9)
	if x ~= - 1 and y ~= - 1 then
		return true
	end
	return false
end

function 入口_温特科学园()
	
	for i = 1 , 5 do
		local x , y = findMultiColor(302 , 243 , 548 , 593 , "d6dbd6-202020" , "-36|1|f7f7f7-202020|-51|3|ffffff-202020|3|-5|ffffff-202020|1|-6|a4a2a4-202020|27|-1|ffffff-202020|26|0|a4aaa4-202020|-2|-11|ffffff-202020|3|-10|a4a2a4-202020|-27|-10|fffbff-202020" , 0 , 0.9)
		if x ~= - 1 and y ~= - 1 then
			按下点击(x , y , - 62 , 146 , - 11 , 40)
			return true
		end
		local x1 , y1 = findMultiColor(302 , 243 , 548 , 593 , "ffffff-202020" , "-38|6|ffffff-202020|-41|4|ffffff-202020|11|7|ffffff-202020|41|-5|ffffff-202020|34|3|efefef-202020|32|-1|ffffff-202020|-37|-1|e6e7e6-202020|-49|-8|ffffff-202020|6|-2|e6e3de-202020" , 0 , 0.9)
		if x ~= - 1 and y ~= - 1 then
			按下点击(x1 , y1 , - 47 , 159 , - 11 , 40)
			return true
		end
		sleep(50)
	end
	
	return false
end
function 入口_温特科学园随机副本()
	
	-- 将所有操作放入一个表中
	local 操作列表 = {
		function() 按下点击({183 , 195 , 267 , 350}) end , --1
		function() 按下点击({375 , 344 , 459 , 507}) end , --2
		function() 按下点击({823 , 357 , 906 , 502}) end , --3
		--function()按下点击({1019 , 192 , 1092 , 346}) end , --4
		
	}
	
	-- 随机选择一个操作执行
	local 随机索引 = math.random(1 , #操作列表)
	print("执行随机操作 " .. 随机索引)
	
	操作列表[随机索引]()
end

function 判断_已侵蚀之地()
	
	local x , y = findMultiColor(1029 , 215 , 1145 , 249 , "fffbce-202020" , "-37|2|bdb694-202020|-28|1|c5c29c-202020|-41|-6|ffffce-202020|53|0|ffffce-202020|48|-5|fffbce-202020|54|-8|f7f3c5-202020|51|-14|ffffce-202020|13|-16|ffffce-202020|12|2|bdba94-202020|26|-14|cecaa4-202020|-6|-6|fffbce-202020|-6|-21|fffbce-202020|-23|-10|efe7bd-202020|-20|0|fffbce-202020|-44|-21|b5b294-202020|-45|-16|5a554a-202020|-42|-16|94927b-202020|-43|-13|948e7b-202020|-30|-15|c5c2a4-202020|-28|-12|fffbce-202020" , 0 , 0.9)
	if x ~= - 1 and y ~= - 1 then
		显示('已侵蚀之地')
		return true
	end
	return false
end

function 入口_侵蚀之地()
	
	setDict(0 , "地图入口.txt")
	useDict(0)
	for i = 1 , 5 do
		local ret , x , y = findStr(62 , 246 , 164 , 592 , "侵蚀之地" , "ffffff-303030" , 0.8 , 10 , 10)
		if x ~= - 1 then
			显示('已找到侵蚀之地')
			按下点击( x , y , - 1 , 196 , - 1 , 77)
			return true
		end
		sleep(50)
	end
	显示('未找到侵蚀之地')
	return false
end
