local GongGaoLieBiao = {
   "版本v.141更新内容:" ,
	"1,新增使用黄金胶囊(新的回归活动可以直升75级)" ,
	"2, 优化创建角色职业的选择(创新区时默认创建女鬼剑)" ,
	"3, 更新自动生成创建新区的配置文件" ,
	"版本v.139更新内容:" ,
	"1,新增领限时活动深渊爽刷奖励(勾选立即使用物品,这个罐子就会自动开)" ,
	"2, 优化猫图极速版(速度大幅提升)" ,
	"版本v.134更新内容:" ,
	"1,修复穿史诗装备" ,
	"2,修复主线70-75级地下城判断" ,
	"3,修复自动上架拍卖行" ,
	"4,关新弹窗广告" ,
	"版本v.129更新内容:" ,
	"1,新增深渊连续通关功能开关(在通用功能界面制作深渊票那行)" ,
	"版本v.128更新内容:" ,
	"1,更新领取天空套" ,
	"版本v.127更新内容:" ,
	"1,更新支持黑龙版本" ,
	"2,新增领取官方邮箱功能开关(默认角色1执行)" ,
	"3,新增黑龙版本的回归奖励领取" ,
	"版本v.122更新内容:" ,
	"1,增加黄金翻牌开关" ,
	"2,副本2燃烧疲劳开关" ,
	"3,新增活动对新版倒计时的7天签到领取" ,
	"版本v.119更新内容:" ,
	"1 , 新增超越副本(超进化火山带 , 超视界藏匿处 , 超负荷发电站)建议选最低难度 , 用完3个复活币过不了就判断打不过就不会再打了" ,
	"2 , 每周冒险团奖励增加完成微信启动特权任务(默认执行的 , 一般在完成2 - 3个任务了才会去完成)" ,
	"版本v.118更新:" ,
	"1.优化账号备份,恢复的逻辑" ,
	"2.优化刷图速度" ,
	"版本v117更新:优化脚本定时启动逻辑" ,
	"版本v116更新:" ,
	"1,主线任务使用经验宝库" ,
	"2,自动穿ss套装的时候可一键升星." ,
}

local function 获取公告内容()
	return table.concat(GongGaoLieBiao , "\n")
end

local GongGaoNeiRong = {
	notice = 获取公告内容()
}

更新内容 = GongGaoNeiRong.notice

