
function 获取普通攻击范围()

	local 机型 = 获取设备类型()
	
	if 机型 == 0 then
		
		return math.random(1118 , 1168) , math.random(633 , 671) --默认机型
		
	else
	 
		return math.random(1023 , 1069) , math.random(614 , 660) --小米8
	end
	
end
function 获取普通攻击范围_范围()
	
	local 机型 = 获取设备类型()
	if 机型 == 0 then
		
		return 1118,633,1168,671--默认机型
		
	else
		return 1023,615,1069,659 --小米8
	end
	
end
function 获取后跳点击范围()
	
	local 机型 = 获取设备类型()
	
	if 机型 == 0 then
		
		return 1022,629,1059,670--默认机型
		
	else
		return 927,621,965,656--小米8
	end
	
end
function 判断_可后跳()
	
	local x , y = findMultiColor(1021 , 660 , 1047 , 686 , "522d10-202020" , "-8|14|efe7ad-202020|3|9|f7ebad-202020|8|-3|8c4d19-202020|-1|15|211d19-202020|-9|-3|d56910-202020|-16|10|191410-202020|-18|-7|f7fbad-202020|-16|-1|d6d294-202020|-14|7|dedb9c-202020|-8|11|efe7ad-202020|4|14|211c19-202020|-17|14|d67908-202020|-19|13|ce8610-202020|-21|14|dece10-202020|-23|5|101010-202020|-26|0|deda19-202020|-26|-1|dedb42-202020|-27|-3|dea210-202020" , 0 , 0.9)
	if x ~= - 1 and y ~= - 1 then
		return false
	end
	return false
end

function 技能_后跳()
	
	local X1 , Y1 , X2 , Y2 = 获取后跳点击范围()
	if 判断_可后跳() then
		按下点击({X1 , Y1 , X2 , Y2})
		随机延时(300 , 400)
	end
	
end
function 获取技能11范围()
	
	local 机型 = 获取设备类型()
	if 机型 == 0 then
		return 588,633,627,668 --默认机型
	else
		return 492,619,529,656 --小米8
	end
	
end

function 长按普通攻击()
	
	local X1 , Y1 , X2 , Y2 = 获取普通攻击范围_范围()
	
	按下点击({X1 , Y1 , X2 , Y2} , {1000 , 1500})
	
end
function 长按普通攻击拾取()
	
	local X1 , Y1 , X2 , Y2 = 获取普通攻击范围_范围()
	按下点击({X1 , Y1 , X2 , Y2} , {2000 , 3000})
	
end

function 普通攻击()
	local X1 , Y1 , X2 , Y2 = 获取普通攻击范围_范围()
	local count = math.random(5 , 7) -- 随机循环3到6次
	for i = 1 , count do
		按下点击( {X1 , Y1 , X2 , Y2} , {30 , 50})
		随机延时(50 , 80)
	end
end
function 随机点击普通攻击()
	local X1 , Y1 , X2 , Y2 = 获取普通攻击范围_范围()
	local count = math.random(1 , 3) -- 随机循环3到6次
	for i = 1 , count do
		按下点击({X1 , Y1 , X2 , Y2} , {30 , 50})
		随机延时(50 , 70)
	end
end
function 判断_转职修炼场_格兰()
	
	local x , y = findMultiColor(1157 , 154 , 1274 , 171 , "c59600-202020" , "-32|3|c59a00-202020|41|4|947100-202020|26|1|a47d00-202020|-14|-10|ffc200-202020|60|-1|deaa00-202020|41|-5|c59600-202020|3|-10|ffc200-202020|-37|-1|deaa00-202020|-45|-5|bd9200-202020|-13|-3|c59a00-202020|-28|-2|cea200-202020|13|-5|f7be00-202020|-53|-10|ffc200-202020|20|-3|f7be00-202020|15|2|bd9200-202020|21|-10|ffc200-202020|35|3|efb600-202020|49|-10|ffc200-202020|-17|4|e6ae00-202020" , 0 , 0.9)
	if x ~= - 1 and y ~= - 1 then
		return true
	end
	return false
end
function 转职释放技能顺序()
	local 机型 = 获取设备类型()
	
	if 机型 == 0 then
		
		----------------------------
		--默认机型
		按下点击({922 , 634 , 966 , 677})
		随机延时(400 , 600)
		按下点击({951 , 521 , 993 , 569})
		随机延时(400 , 600)
		按下点击({1064,549,1110,590})
		-----------------------------
	else
		----------------------------
		--小米8机型
		按下点击({822 , 617 , 871 , 665})
		随机延时(400 , 600)
		按下点击({851 , 505 , 901 , 557})
		随机延时(400 , 600)
		按下点击({935 , 420 , 985 , 470})
		-----------------------------
	end
	
end

function 技能1()
	按下点击({443,631,481,669})--技能1
	
end

function 技能2()
	按下点击({518,627,549,673} , {30 , 50})--技能2
end
function 技能3()
	按下点击({589,631,623,673} , {30 , 50})--技能3
	
end
function 技能4()
	按下点击({816,631,866,673} , {30 , 50})--技能4
	
end
function 技能5()
	按下点击({761,550,811,593} , {30 , 50})--技能5
	
end
function 技能6()
	按下点击({861,546,909,592} , {30 , 50})--技能6
	
end
function 技能7()
	按下点击({968,546,1007,593} , {30 , 50})--技能7
	
end

function 技能8()
	--按下点击({935,227,968,259})--技能8
	if 获取设备类型() == 0 then
		
		滑动(393,649 , 387,566 , 10 , 10 , {15 , 25} , {200 , 300} , {100 , 200})
	else
		滑动(855 , 229 , 851 , 113 , 10 , 10 , {15 , 25} , {200 , 300} , {100 , 200})
	end
	
end

function 技能9()
	按下点击({1003 , 223 , 1042 , 264} , {30 , 50})--技能9
	
end

function 技能10()
	
	local X1 , Y1 , X2 , Y2 = 获取技能11范围()
	
	按下点击({X1 , Y1 , X2 , Y2} , {30 , 50})--技能10
	
end

function 技能11()
	local x1 , y1 , x2 , y2 = 获取技能11范围()
	按下点击({x1 , y1 , x2 , y2} , {30 , 50})--技能11
	
end

function 技能_觉醒()
	
	if 获取设备类型() == 0 then
		滑动(1146,486 ,1145,396 , 5 , 5 , {15 , 30} , {300 , 400})
	else
		滑动(1050,474 , 1046,369 , 5 , 5 , {15 , 30} , {300 , 400})
	end
	
end

function 随机释放技能()
	-- 将所有技能函数放入一个表中
	print('随机释放技能')
	 
	local 技能列表 = {
		技能1 ,
		技能2 ,
		技能3 ,
		技能4 ,
		技能5 ,
		技能6 ,
		技能7 ,
		 
	}
	
	-- 打乱技能顺序（随机排序）
	for i = #技能列表 , 2 , - 1 do
		local j = math.random(1 , i)
		技能列表[i] , 技能列表[j] = 技能列表[j] , 技能列表[i]
	end
	
	-- 依次释放所有技能
	for i , 技能 in ipairs(技能列表) do
		技能() -- 调用技能函数
		if i < #技能列表 then -- 如果不是最后一个技能
			随机延时(100 , 110) -- 技能之间的间隔
		end
	end
end
function 随机释放技能单手模式()
	-- 将所有技能函数放入一个表中
	print('随机释放技能')
	
	local 技能列表 = {
		技能1 ,
		技能2 ,
		技能3 ,
		技能4 ,
		技能5 ,
		技能6 ,
		技能7 ,
		技能9 ,
		基技能10 ,
		技能11 ,
	}
	
	-- 打乱技能顺序（随机排序）
	for i = #技能列表 , 2 , - 1 do
		local j = math.random(1 , i)
		技能列表[i] , 技能列表[j] = 技能列表[j] , 技能列表[i]
	end
	
	-- 依次释放所有技能
	for i , 技能 in ipairs(技能列表) do
		技能() -- 调用技能函数
		if i < #技能列表 then -- 如果不是最后一个技能
			随机延时(30 , 80) -- 技能之间的间隔
		end
	end
end
